[{"addr": ["\r\n      Bala Lake Foreshore, Bala, Gwynedd, LL23 7SR, Wales\r\n    "], "tel": ["\r\n          +44 01678 521059\r\n        "], "name": ["\r\n      Bala Adventure & Watersports\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.balawatersports.com"], "desc": ["\r\n            We have some of the most qualified and experienced coaches in Britain, with all the latest equipment to make your time with us both enjoyable and unforgettable. Great people, great location, great kit.", "Come to us to develop your skills and qualifications, or use our facilities for the sheer fun of it. Try a half day taster course in any activity, or take a fully accredited training course. You can even mix and match activities. We specialise in small groups for the best coaching experience, whether you’re an absolute beginner or an expert seeking to extend yourself to the limit.", "Windsurfing - Windsurfing on Bala Lake is continually growing in popularity - our windsurfing courses allow you to use the newest equipment in a safe environment. The centre is a HYFLY demonstration centre so you will be able to use the equipment made available by HYFLY. Our instructors will give you the right level of tuition to get you on the board and to experience this great sport confidently. For those who have had a go before, we will be able to help you improve your existing skills and develop new ones. Our staff are always keen to give advice both on and off the water and are usually available for one-to-one coaching if required. Our equipment is available for hire to the more experienced sailor.", "Kayaking/Canoeing - Beginner or expert can enjoy the ideal location of Bala Watersports for an introduction to the sport on Bala Lake or experience the challenging rapids of the local world-class white-water course. ", "Our resident coaches cover the entire spectrum of the British Canoe Association syllabus.", "Sailing - Sailing courses are run accourding to the royal yachting association guidlines. Bookings can be made over the phone or via our online booking facility.", "Branwen trips, why not explore the lake and use the steam train to get back to Bala or sail back.", "Rock Climbing/Abseiling - North Wales offers some of the best climbing in the country and you will be able to experience some of the spectacular locations. Under the close supervision of our instructors you can enjoy some great challenges and the personal achievement of getting to the top.\r\n          "]},
{"addr": ["\r\n      16 Maes Y Garnedd, Bethesda, Gwynedd, LL57 3BP, Wales\r\n    "], "tel": ["\r\n          +44 07859 024799\r\n        "], "name": ["\r\n      Snowdonia Outdoor Adventure\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.snowdoniaoutdooradventure.co.uk/COASTEERING.html"], "desc": ["\r\n            Snowdonia Outdoor Adventure provide unique water and rock based adventure activities - Coasteering, Gorge Walking, Rock Climbing, Mountain Walking, Abseiling and Sea Level Traversing.", "All instructors hold national governing body awards and are experienced in the activities that they run. Whether it is a family day out, team building or just some fun with friends that you are after, Snowdonia Outdoor Adventure can tailor a course to suit your needs.\r\n          "]},
{"addr": ["\r\n      Bryn-y-moel, Llanbedr, Gwynedd, LL45 2HU, Wales\r\n    "], "tel": ["\r\n          +44 01341 241358\r\n        "], "name": ["\r\n      The Ranch Outdoor Discovery Centre\r\n    "], "catid": ["Index-101321143513%252c"], "site": ["http://www.actioncentres.co.uk"], "desc": ["\r\n            The Ranch Outdoor Discovery Centre exists to offer young people opportunities for exciting residential experiences all year round in the heart of Snowdonia - with an emphasis on personal discovery, education, safety and fun!\r\n          "]},
{"addr": ["\r\n      Llanwnda, Caernarfon, Gwynedd, LL54 5SD, Wales\r\n    "], "tel": ["\r\n          +44 01286 830522\r\n        "], "name": ["\r\n      Nth Degree Mtb Ultimate Trails in Wales\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.nthdegreemtb.com"], "desc": ["\r\n            Neil has first hand knowledge of the many single-track routes that are available in this area. He helped advise and build the Red Bull Mountain Bike Trail at Coed y Brenin...\r\n          "]},
{"addr": ["\r\n      Lakeside Cafe, Llyn Crafnant, Trefriw, Conwy, LL27 0JZ, Wales\r\n    "], "tel": ["\r\n          +44 01492 640818\r\n        "], "name": ["\r\n      Llyn Crafnant Trout Fishing\r\n    "], "catid": ["Index-101321143771%252c"], "site": ["http://www.crafnantfishing.co.uk"], "desc": ["\r\n            Lake Crafnant is in the hills above Trefriw in a stunning North Wales valley. Fish for trout in this 63 acre natural mountain lake, stocked with rainbow trout and wild brown trout. Lakeside cafe and tea gardens. Also tackle for sale.\r\n          "]},
{"addr": ["\r\n      The Mountain Paragliding Centre, Mynydd Llandegai, Bangor, Gwynedd, LL57 4BZ, Wales\r\n    "], "tel": ["\r\n          +44 01248 600330\r\n        "], "name": ["\r\n      Snowdon Gliders\r\n    "], "catid": ["Index-101321143392%252c"], "site": ["http://www.snowdongliders.co.uk"], "desc": ["\r\n            As well as selling paragliding equipment we also offer paragliding instruction to small groups and individuals. As a flight school, Snowdon Gliders has an enviable safety record built on the Chief Flying Instructor: Brad Nicholas's 20 year experience in Paragliding and Hanggliding.\r\n          "]},
{"addr": ["\r\n      Y Bala Golf Club, Penlan, Bala, Gwynedd, LL23 7YD, Wales\r\n    "], "tel": ["\r\n          +44 01678 520359\r\n        "], "name": ["\r\n      Y Bala Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.golffbala.co.uk"], "desc": ["\r\n            Bala Golf Course is a very challenging 10-hole course looking over Bala Lake or Llyn Tegid - at over 3 miles long the largest natural lake in Wales. Designed by the renowned Llandudno Pro, Syd Collins, the course has given nature a free hand in providing the natural hazards required for a great round of golf. Whether you are Tiger Woods or merely a beginner, you will find the test of skill at Bala intriguing without being too exacting. The clean Bala air also imparts wonderful vigour to a great day's golfing.\r\n          "]},
{"addr": ["\r\n      Glynllifon, Caernarfon, Gwynedd, LL54 5DU, Wales\r\n    "], "tel": ["\r\n          +44 01286 830261\r\n        "], "name": ["\r\n      Coleg Meirion-Dwyfor\r\n    "], "catid": ["Index-101321143402%252c"], "site": [], "desc": ["\r\n            Coleg Meirion-Dwyfor has something for everyone, whatever your age, background or interest.\r\n          "]},
{"addr": ["\r\n      Llannerch Farm, Porthmadog, Gwynedd, LL49 9UR, Wales\r\n    "], "tel": ["\r\n          +44 01766 512468\r\n        "], "name": ["\r\n      Porthmadog Activity Centre\r\n    "], "catid": ["Index-101321143411%252c"], "site": ["http://porthmadog-activity-centre.co.uk"], "desc": ["\r\n            A complete range of services we can offer you for  that special holiday or family day out. For more  serious riders we offer trekking holidays, you  can even bring your own horse (we will provide stable and livery) and stay on our 250 acre site, and enjoy the miles of off road trekking with stunning views that we have to offer. ", "For those more mechanically minded we also offer Junior Quad biking on our own circuit, a Bunnyland where you can meet he pets here at the centre, together with the usual light refreshments.\r\n          "]},
{"addr": ["\r\n      Gelli Isaf, Rhyd Uchaf, Bala, Gwynedd, LL23 7SB, Wales\r\n    "], "tel": ["\r\n          +44 01678 521871\r\n        "], "name": ["\r\n      Wild Walks Wales\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.wildwalkswales.co.uk"], "desc": ["\r\n            We offer a range of exciting outdoor activities and skills courses throughout North Wales, including guided mountain and hill walking, rock climbing and abseiling sessions, orienteering and wildlife walks. We also offer specialist mountain walking holidays, discovering the beauty of the wildest parts of Wales.", "Our enthusiastic and knowledgeable guides do much more than take you on a walk, and during your time with us you’ll find out about the wildlife, history and geology of the area too. Open your eyes to the beauty of Wales! ", "Wild Walks Wales also run a range of skills courses for walkers and climbers. We are Mountain Training providers for the Hill and Mountain Skills Scheme, Lowland Leader Award, and Expedition Skills Module. We also run the full range of National Navigation Award Scheme courses at all levels and specialist workshops including Night Navigation' and 'Winter Walking Skills.", "We can tailor walks and courses to suit your requirements, needs and location – give us a call to discuss what you’d like to do.\r\n          "]},
{"addr": ["\r\n      The Church Rooms, Llwyngwril, Llwyngwril, Gwynedd, LL37 2JQ, Wales\r\n    "], "tel": ["\r\n          +44 01341 250054\r\n        "], "name": ["\r\n      Llwyngwril Gallery, South Snowdonia, Gwynedd.\r\n    "], "catid": ["Index-101520163302%252c"], "site": ["http://www.llwyngwril-gallery.co.uk"], "desc": ["\r\n            Llwyngwril Art Gallery is situated in the picturesque coastal village of Llwyngwril, Gwynedd in Snowdonia National Park.  The Gallery sells only Welsh Art and Crafts, of a high quality, and is complemented by the Tea Room, enabling a visit to be more of an outing and cultural experience - a wonderful, relaxing time, to take in all the Arts and Crafts, in a building full of character.  The building was originally a Church of England School, when it was built in the 1830s. It was more latterly used as a Church Hall, until it fell into disrepair, and the present owners, Debbie Ashton and Peter Jarrard bought it from the Church of Wales at the beginning of 2002.  All are welcome.\r\n          "]},
{"addr": ["\r\n      Unit 2, Canolfan Dyfi, Aberdovey, Gwynedd, LL35 0EE, Wales\r\n    "], "tel": ["\r\n          +44 01654 767676\r\n        "], "name": ["\r\n      Dyfi Discoveries\r\n    "], "catid": ["Index-101520093023%252c"], "site": ["http://www.dyfidiscoveries.co.uk"], "desc": ["\r\n            Join us to learn about local legends, heritage and wildlife in the beautiful scenery around the coast of Mid-Wales. Our 12 seater rigid inflatable boat is purpose-built and provides comfortable bench-type seating for all passengers. It will carry you safely round Cardigan Bay, affording you fantastic views of both the scenery and wildlife. ", "Life-jackets provided and fitted for everyone on board. Please wear warm and waterproof clothing.\r\n          "]},
{"addr": ["\r\n      Bala Lake Foreshore, Bala, Gwynedd, LL23 7SR, Wales\r\n    "], "tel": ["\r\n          +44 01678 521059\r\n        "], "name": ["\r\n      Bala Adventure & Watersports\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.balawatersports.com"], "desc": ["\r\n            We have some of the most qualified and experienced coaches in Britain, with all the latest equipment to make your time with us both enjoyable and unforgettable. Great people, great location, great kit.", "Come to us to develop your skills and qualifications, or use our facilities for the sheer fun of it. Try a half day taster course in any activity, or take a fully accredited training course. You can even mix and match activities. We specialise in small groups for the best coaching experience, whether you’re an absolute beginner or an expert seeking to extend yourself to the limit.", "Windsurfing - Windsurfing on Bala Lake is continually growing in popularity - our windsurfing courses allow you to use the newest equipment in a safe environment. The centre is a HYFLY demonstration centre so you will be able to use the equipment made available by HYFLY. Our instructors will give you the right level of tuition to get you on the board and to experience this great sport confidently. For those who have had a go before, we will be able to help you improve your existing skills and develop new ones. Our staff are always keen to give advice both on and off the water and are usually available for one-to-one coaching if required. Our equipment is available for hire to the more experienced sailor.", "Kayaking/Canoeing - Beginner or expert can enjoy the ideal location of Bala Watersports for an introduction to the sport on Bala Lake or experience the challenging rapids of the local world-class white-water course. ", "Our resident coaches cover the entire spectrum of the British Canoe Association syllabus.", "Sailing - Sailing courses are run accourding to the royal yachting association guidlines. Bookings can be made over the phone or via our online booking facility.", "Branwen trips, why not explore the lake and use the steam train to get back to Bala or sail back.", "Rock Climbing/Abseiling - North Wales offers some of the best climbing in the country and you will be able to experience some of the spectacular locations. Under the close supervision of our instructors you can enjoy some great challenges and the personal achievement of getting to the top.\r\n          "]},
{"addr": ["\r\n      1st Floor, Unit 6, Yr Hafan, Pwllheli, Gwynedd, LL53 5YT, Wales\r\n    "], "tel": ["\r\n          +44 01758 701379\r\n        "], "name": ["\r\n      Offshore Sea School\r\n    "], "catid": ["Index-101322143512%252c"], "site": ["http://www.offshoreseaschool.com"], "desc": ["\r\n            Based at Pwllheli, we can offer a range of Jet Ski, Powerboat and Motor Cruising courses, theory and practical all performed by RYA Instructors.  Customised training and corporate days are also available.  Our cruising ground includes Anglesey, South Wales coast and Ireland, courses being available all year, weather permitting.\r\n          "]},
{"addr": ["\r\n      Y Felinheli, Gwynedd, Y Felinheli, Gwynedd, LL564HQ, Wales\r\n    "], "tel": ["\r\n          +44 01248 670776\r\n        "], "name": ["\r\n      Anglesey Sail and Power\r\n    "], "catid": ["Index-101322143415%252c"], "site": ["http://www.angleseysailandpower.co.uk"], "desc": ["\r\n            RYA accredited sailing & powerboat training centre based on the Menai Strait. We run RYA powerboat courses in our 6m humber rib & sailing courses in our 2 hunter 707 keelboats. Corporate & teambuilding days & sailing taster sessions.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Aberdovey, Gwynedd, LL35 0RA, Wales\r\n    "], "tel": ["\r\n          +44 01654 767464\r\n        "], "name": ["\r\n      Aberdovey Centre\r\n    "], "catid": ["Index-101322143417%252c"], "site": [], "desc": ["\r\n            The Welsh Centre, close to the coastal village of Aberdovey, has spectacular views over the Dyfi estuary. Water activities are based at our specialist wharf facility. Our expeditions and rock climbing are in quiet, remote mountains and sea cliffs close to the centre. Forest cabins are available for overnight expeditions.\r\n          "]},
{"addr": ["\r\n      The Foreshaw, Bala, Gwynedd, LL23 7BS, Wales\r\n    "], "tel": ["\r\n          +44 01678 520480\r\n        "], "name": ["\r\n      Bala Sailing Club\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.balasc.org.uk/"], "desc": ["\r\n            Bala Sailing Club is set at the North-East end of Bala Lake giving easy access to the largest & possibly the most picturesque sailing water in Wales. The mainly South-westerly winds provide excellent sailing conditions & the well equipped clubhouse & bespoke training room make Bala one of the most popular sailing venues in the UK. ", "The club is family oriented & offers a wide range of facilities to members & visitors alike. Regular club racing & open events go hand in hand with a more leisurely cruising section for those who simply want to enjoy the lake & beautiful surroundings.", "The magnificent views from the clubhouse & sun terrace can be supplemented with drinks from a well stocked bar or hot & cold food & drinks from the professionally run galley.\r\n          "]},
{"addr": ["\r\n      5 Hafan Marina Workshops, Glan Don, Pwllheli, Gwynedd, LL53 5YW, Wales\r\n    "], "tel": ["\r\n          +44 01758 701222\r\n        "], "name": ["\r\n      Network Yacht Brokers (Pwllheli)\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://offices.networkyachtbrokers.co.uk"], "desc": ["\r\n            Network Yacht Brokers is a group of 10 individual businesses, primarily offering brokerage services for both power and sail boats. Mick and Lynn Killip took over Network Yacht Brokers Pwllheli in August 2009, to expand their marine business interests with support from their daughter Sarah.\r\n          "]},
{"addr": ["\r\n      Brig Y Don, Hopeland Road, Aberdovey, Gwynedd, LL35 0NH, Wales\r\n    "], "tel": ["\r\n          +44 01654 767301\r\n        "], "name": ["\r\n      Aberdovey Sailing\r\n    "], "catid": ["Index-101322143518%252c"], "site": [], "desc": ["\r\n            Brig Y Don is a spectacular home overlooking the whole of the Dovey Estuary, and looking out across Aberdovey village. We can offer you everything that will allow you to have a wonderful stay ...", "Our facilities include beautiful gardens, secure on site car-parking, en-suite sea view bedrooms, locally sourced & organic foods and most importantly, peace and quiet.", "For more information please contact us on +44 (0)1654 767 301, mobile +44(0)7817 800 625, or simply send us a message using the form opposite.", "Our NEW website is up & running! Visit http://www.aberdoveyaccommodation.co.uk for the latest deals and special rates available at Brig Y Don - One of Aberdovey's finest B&Bs.", "NEW SPECIAL OFFERS", "Mid-week Breaks! From Sunday night to Thursday night!", "Usual price £70 per room/night:", "Stay 2 nights - £10 off", "Stay 3 nights - £20 off", "Stay 4 nights - £30 off", "Stay 5 nights - £40 off\r\n          "]},
{"addr": ["\r\n      The Quay, Barmouth, Gwynedd, LL42 1HB, Wales\r\n    "], "tel": ["\r\n          +44 01341 280000\r\n        "], "name": ["\r\n      Merioneth Yacht Club\r\n    "], "catid": ["Index-101322143518%252c"], "site": [], "desc": ["\r\n            The Club is located in Barmouth which is on the edge of Snowdonia National Park giving access to Cardigan Bay one of the most picturesque sailing areas in Wales. The mainly southerly winds provide excellent sailing conditions. The well equipped clubhouse and training room make Merioneth Yacht Club one of the most popular sailing venues in the country. The Club House bar provides what is described as one of the most beautiful views in Wales , where the mountains come down to the sea, with the added pleasure of a cool beer or glass of wine to enjoy it by.", "There are monthly social events , a very strong racing program and an enthusiastic Celtic Longboat rowing section. Junior sailing is thriving with training sessions throughout the summer.", "The club runs RYA theory courses in the winter months and has a power boat section which runs practical power boat and personal watercraft courses in the summer months.", "In the club house there is a computer with broad band which members can use.\r\n          "]},
{"addr": ["\r\n      8 Llys-y-mor, Plas Menai, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670738\r\n        "], "name": ["\r\n      Welsh Yachting Association\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.welshsailing.org"], "desc": ["\r\n            The Welsh Yachting Association (WYA) is the National Governing Body for the sports of sailing, windsurfing and powerboating in Wales. The WYA is also the Royal Yachting Association (RYA) Council for Wales. The RYA is the British Governing Body and is a Member National Authority of the International Sailing Federation (ISAF). The WYA is funded by Sports Council for Wales (SCW) and the Royal Yachting Association as well as creating revenue from events, training and sponsorship opportunities.\r\n          "]},
{"addr": ["\r\n      Joint Services Mountain Training Centre, Portdinorwic Marina, Y Felinheli, Gwynedd, LL56 4JN, Wales\r\n    "], "tel": ["\r\n          +44 01248 673200\r\n        "], "name": ["\r\n      Sea Training International Ltd\r\n    "], "catid": ["Index-101322143518%252c"], "site": [], "desc": ["\r\n            Why you should choose Sea Training International Ltd ?", "    * We are an established company with a large and well reputed client list.", "    * We have a long and success record of projects completed on time and within a budget.", "    * We develop outstanding solutions. Check out our portfolio, client list and newsletter.", "    * We are your single point for all of your needs related to training and support, on and off the ocean.\r\n          "]},
{"addr": ["\r\n      Cefn Y Coed Uchaf, Llanfaglan, Caernarfon, Gwynedd, LL54 5RF, Wales\r\n    "], "tel": ["\r\n          +44 01286 672773\r\n        "], "name": ["\r\n      Ocean Discovery\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.oceandiscovery.net"], "desc": ["\r\n            For the last 5 years Ocean Discovery has bare boat chartered  its Santana 39 foot Sailing yacht 'Mistral' to those with the relevant qualifications and aspirations to explore the Irish Sea on their own from our base in North Wales. In tandem with this, we have skippered trips of our own bringing a 'Teaching on the Move' ethos to sailing, sharing our knowledge and experience as the voyage unfolds.", "In past years we have been involved in training and leading sea kayak expeditions around the coasts of Alaska, Norway, Scotland and Wales, but as of 2009 this will no longer be a structured activity and those wishing to do something along these lines should contact us direct with requests for bespoke courses.", "In Sept 2001 the director returned successfully from participating as a skipper sailing in Sir Robin Knox Johnston's \"Times Clipper 2000\" Round the World Race. This event covers 35,000 nm, lasts 11 months and focuses on teamwork, turning amateur crews into skilled ocean racers.\r\n          "]},
{"addr": ["\r\n      Hafan, Pwllheli, Gwynedd, LL53 5YT, Wales\r\n    "], "tel": [], "name": ["\r\n      Pwllheli Sailing Club\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.pwllhelisailingclub.co.uk"], "desc": ["\r\n            Clwb Hwylio Pwllheli Sailing Club is located in the marina complex at Hafan Pwllheli. The building is within the marina complex about 150 yards from the pontoons.\r\n          "]},
{"addr": ["\r\n      Pensarn Harbour, Llanbedr, Gwynedd, LL45 2HS, Wales\r\n    "], "tel": ["\r\n          +44 01341 241646\r\n        "], "name": ["\r\n      CMC Pensarn Harbour\r\n    "], "catid": ["Index-101322143518%252c"], "site": [], "desc": ["\r\n            Our centres at Pensarn Harbour & Bryn-y-Moel are set in fantastic locations: nestled in between the vast unspoilt beaches of the Cambrian coast and the wild beauty of the Rhinog mountain range, the centres are truly set in the heart of the Snowdonia National Park.\r\n          "]},
{"addr": ["\r\n      Bala Lake Foreshore, Bala, Gwynedd, LL23 7SR, Wales\r\n    "], "tel": ["\r\n          +44 01678 521059\r\n        "], "name": ["\r\n      Bala Adventure & Watersports\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.balawatersports.com"], "desc": ["\r\n            We have some of the most qualified and experienced coaches in Britain, with all the latest equipment to make your time with us both enjoyable and unforgettable. Great people, great location, great kit.", "Come to us to develop your skills and qualifications, or use our facilities for the sheer fun of it. Try a half day taster course in any activity, or take a fully accredited training course. You can even mix and match activities. We specialise in small groups for the best coaching experience, whether you’re an absolute beginner or an expert seeking to extend yourself to the limit.", "Windsurfing - Windsurfing on Bala Lake is continually growing in popularity - our windsurfing courses allow you to use the newest equipment in a safe environment. The centre is a HYFLY demonstration centre so you will be able to use the equipment made available by HYFLY. Our instructors will give you the right level of tuition to get you on the board and to experience this great sport confidently. For those who have had a go before, we will be able to help you improve your existing skills and develop new ones. Our staff are always keen to give advice both on and off the water and are usually available for one-to-one coaching if required. Our equipment is available for hire to the more experienced sailor.", "Kayaking/Canoeing - Beginner or expert can enjoy the ideal location of Bala Watersports for an introduction to the sport on Bala Lake or experience the challenging rapids of the local world-class white-water course. ", "Our resident coaches cover the entire spectrum of the British Canoe Association syllabus.", "Sailing - Sailing courses are run accourding to the royal yachting association guidlines. Bookings can be made over the phone or via our online booking facility.", "Branwen trips, why not explore the lake and use the steam train to get back to Bala or sail back.", "Rock Climbing/Abseiling - North Wales offers some of the best climbing in the country and you will be able to experience some of the spectacular locations. Under the close supervision of our instructors you can enjoy some great challenges and the personal achievement of getting to the top.\r\n          "]},
{"addr": ["\r\n      Ynys Fechan Hall, Arthog, Dolgellau, Fairbourne, Gwynedd, LL39 1YT, Wales\r\n    "], "tel": ["\r\n          +44 01341 250369\r\n        "], "name": ["\r\n      Crisis Care - Ynys Fechan Hall\r\n    "], "catid": ["Index-101322143518%252c"], "site": [], "desc": ["\r\n            Activity Centre\r\n          "]},
{"addr": ["\r\n      Main Office, Beach Hut Area, Bennar Headland, Abersoch, Gwynedd, LL53 7DP, Wales\r\n    "], "tel": ["\r\n          +44 01758 712963\r\n        "], "name": ["\r\n      Abersoch Sailing School\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.abersochsailingschool.com"], "desc": ["\r\n            Watersports centre specialising in sailing, kayaking and rafting. Lessons available. Children and groups catered for. Boat hire also available including catamarans, speedboats, fun boats and canoes. March to November.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670964\r\n        "], "name": ["\r\n      Plas Menai\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.plasmenai.co.uk"], "desc": ["\r\n            Plas Menai is the National Watersports Centre based on the banks of the Menai Strait overlooking the Isle of Angelsey. Owned and operated by Sport Wales, the centre and facilities is set in four acres of landscaped grounds with a large waterfront and dedicated slipway. ", "The Centre is a recognised RYA and BCU training centre and offers technical courses in sailing, windsurfing, powerboating, cruising, kayaking and instructor training. During the summer holidays, Plas Menai runs a variety of youth actvity holidays for children aged between 8-17yrs. The centre also runs adventure activities for families, schools, groups and teambuilding events for corporate customers.", "The Centre can accommodate up to 100 people in comfortable twin-bedded ensuite rooms in the main complex and in our onsite dormitory style houses and is open throughout the year, (closed during the Christmas period).\r\n          "]},
{"addr": ["\r\n      3 - 4 Bath Place, Aberdyfi, Aberdovey, Gwynedd, LL35 0LN, Wales\r\n    "], "tel": ["\r\n          +44 01654 767024\r\n        "], "name": ["\r\n      Adventure Camps\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://www.adventurecamps.co.uk"], "desc": ["\r\n            Nothing beats the thrill of mountain-biking down some of the UK's most famous mountain bike trails. And virtually nothing beats canyoning down some of Wales best kept secret rivers. Very little beats a multi-activity day of climbing, walking, canoeing, surfing and raft-building. Top this off by camping on a Welsh cliff top watching the sun going down over the spectacular Cardigan Bay whilst enjoying a barbecue.", "Adventure Camps is one of the UK's leading specialist outdoor centres with some of the finest outdoor terrain on its doorstep in the magnificent Snowdonia National Park, Wales. ", "Adventure Camps; Safety, Adventure, Enjoyment, Learning, Challenge… ", "Adventure Camps provide a range of quality, value for money courses such as; ", "Adventure Weekends: ", "Get away from it all and reinvigorate yourself and your group of friends; a great way to celebrate events of all types. ", " ", "Orgainising a stag/hen weekend or day? ", "Call our office on (01654) 767024 or 07960584861 for competitive prices. We can help you with accommodation and a great programme. ", "Adventure Family: ", "Get out and discover the great outdoors, spend time with your family, learn new skills and challenge yourselves with adventurous activities. ", "Adventure Weeks: ", "Designed to promote teamwork and leadership skills. Develops a healthier lifestyle and improves fitness, ideal for youth groups, cadet groups, scouts, guides and explorers.", "Adventure Business: ", "Corporate adventure packages for fun, team development and conferencing. ", "Adventure Schools: ", "Course’s designed for you to meet your aims and objectives. The use of the outdoors makes a major contribution to physical and environmental education and enhances many other curriculum areas. It contributes to personal growth and social awareness and develops skills for life and the working world.\r\n          "]},
{"addr": ["\r\n      Llanuwchllyn, Y Bala, Bala, Gwynedd, LL23 7ST, Wales\r\n    "], "tel": ["\r\n          +44 01678 541000\r\n        "], "name": ["\r\n      Gwersyll yr Urdd Glan-Llyn\r\n    "], "catid": ["Index-101322143518%252c"], "site": ["http://Urdd.org/glanllyn"], "desc": ["\r\n            Gwersyll yr Urdd Glan-llyn is a multi activity centre situated on the shores of Llyn Tegid, near Y Bala, a mile from the village of Llanuwchllyn in the shadow of the Aran and within Eryri, Snowdonia National Park. It is an ideal location for all types of holidays and activity courses.\r\n          "]},
{"addr": ["\r\n      Canolfan Tryweryn, Frongoch, Bala, Gwynedd, LL23 7NU, Wales\r\n    "], "tel": ["\r\n          +44 01678 521083\r\n        "], "name": ["\r\n      White Water Rafting\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://www.ukrafting.co.uk"], "desc": ["\r\n            The National White Water Centre has over 25 years of experience in providing white water rafting at the best summer white water facility in the UK. The Tryweryn River is a steep and rocky mountain river with fast flowing rapids that carry you down the course on an exhilarating and adrenalin fuelled trip. And, because the Tryweryn is a dam controlled river we very often have water when all other rivers are dry!", "The National Whitewater Centre offers a variety of sessions ranging from fun family trips along the lower river to fast flowing group sessions on the upper river.", "Full Session Groups/ Individuals: In the two hours you will get 4 exhilarating and adrenaline fuelled runs down the grade 3/4 mountain river. ", "Taster Session: Not quite sure what to expect? Experience the thrill of white water rafting with 2 runs down in our 14 foot inflatable rafts, lasting just over an hour. ", "The Tryweryn Safari: A family friendly session suitable for children aged 10 years old or over. Tackle rapids, surf waves and bounce off boulders while enjoying breathtaking wild river scenery. ", "Orcas: Two-man inflatable rafts that provide the ultimate thrill for people who are looking for a cross between white water rafting and canoeing. ", "For those wanting a slightly different white water experience, you can leave the raft behind and go canyoning, where you will slide, swim and scramble down the stunning gorge.", "If you don't fancy the adventure of the river, don't worry: there are riverside walks, cafe and picnic areas which give you the opportunity to take in the splendour of the surroundings. We are situated in the heart of Snowdonia National Park, and the breathtaking scenery of the area offers a fantastic retreat, not only for the water sports enthusiast, but for everyone.\r\n          "]},
{"addr": ["\r\n      6 New Street, Aberdovey, Gwynedd, LL35 0EH, Wales\r\n    "], "tel": ["\r\n          +44 01654 767655\r\n        "], "name": ["\r\n      Adrenalin Antics\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://www.adrenalinantics.com"], "desc": ["\r\n            Activity centre providing a wide range of activities including Kayaking, canoeing, mountain biking, rock climbing and more. All activities are led by fully qualified instructors.\r\n          "]},
{"addr": ["\r\n      Pensarn Harbour, Llanbedr, Gwynedd, LL45 2HS, Wales\r\n    "], "tel": ["\r\n          +44 01341 241646\r\n        "], "name": ["\r\n      CMC Pensarn Harbour\r\n    "], "catid": ["Index-101322143417%252c"], "site": [], "desc": ["\r\n            Our centres at Pensarn Harbour & Bryn-y-Moel are set in fantastic locations: nestled in between the vast unspoilt beaches of the Cambrian coast and the wild beauty of the Rhinog mountain range, the centres are truly set in the heart of the Snowdonia National Park.\r\n          "]},
{"addr": ["\r\n      Rhyd-y-coed, The Drapers' Field Centre, Betws-y-coed, Conwy, LL24 0HB, Wales\r\n    "], "tel": ["\r\n          +44 01690 710494\r\n        "], "name": ["\r\n      FSC Rhyd-y-Creuau\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://www.field-studies-council.org/centres/rhydycreuau.aspx"], "desc": ["\r\n            Follow in the footsteps of Darwin to discover the mountain environment of Cwm Idwal, evidence of the glaciated past, human impact today and conservation for the future. ", "The Sand Dunes at Harlech SSSI provide a variety of rich habitats on the pro-grading dune system. Coastal environments include the shingle beach, sea defences and Rocky Shores. ", "Students can discover the extensive forests surrounding the Centre. Opportunities for woodland ecology, soil profiles and orienteering ", "The River Conwy provides opportunities to study downstream changes from upland stream to estuary, freshwater ecosystems and pollution. ", "Betws-y-coed and surrounding settlements provide a range of opportunities for human geography including tourism in the National Park and settlements. ", "Adventurous activities complement fieldwork, including climbing, gorge scrambling and walking in the mountains of Snowdonia.\r\n          "]},
{"addr": ["\r\n      Dinorwic, Caernarfon, Caernarfon, Gwynedd, LL55 3ET, Wales\r\n    "], "tel": ["\r\n          +44 01286 870853\r\n        "], "name": ["\r\n      Blue Peris Mountain Centre\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://www.blueperis.co.uk"], "desc": ["\r\n            An ex-employee once said 'We Do Everything!' Almost all our activities take place off-site in 'real' adventure venues. This requires a higher skill and qualification level from our instructors but greatly enhances the adventure.\r\n          "]},
{"addr": ["\r\n      Llanuwchllyn, Y Bala, Bala, Gwynedd, LL23 7ST, Wales\r\n    "], "tel": ["\r\n          +44 01678 541000\r\n        "], "name": ["\r\n      Gwersyll yr Urdd Glan-Llyn\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://Urdd.org/glanllyn"], "desc": ["\r\n            Gwersyll yr Urdd Glan-llyn is a multi activity centre situated on the shores of Llyn Tegid, near Y Bala, a mile from the village of Llanuwchllyn in the shadow of the Aran and within Eryri, Snowdonia National Park. It is an ideal location for all types of holidays and activity courses.\r\n          "]},
{"addr": ["\r\n      3 - 4 Bath Place, Aberdyfi, Aberdovey, Gwynedd, LL35 0LN, Wales\r\n    "], "tel": ["\r\n          +44 01654 767024\r\n        "], "name": ["\r\n      Adventure Camps\r\n    "], "catid": ["Index-101322143417%252c"], "site": ["http://www.adventurecamps.co.uk"], "desc": ["\r\n            Nothing beats the thrill of mountain-biking down some of the UK's most famous mountain bike trails. And virtually nothing beats canyoning down some of Wales best kept secret rivers. Very little beats a multi-activity day of climbing, walking, canoeing, surfing and raft-building. Top this off by camping on a Welsh cliff top watching the sun going down over the spectacular Cardigan Bay whilst enjoying a barbecue.", "Adventure Camps is one of the UK's leading specialist outdoor centres with some of the finest outdoor terrain on its doorstep in the magnificent Snowdonia National Park, Wales. ", "Adventure Camps; Safety, Adventure, Enjoyment, Learning, Challenge… ", "Adventure Camps provide a range of quality, value for money courses such as; ", "Adventure Weekends: ", "Get away from it all and reinvigorate yourself and your group of friends; a great way to celebrate events of all types. ", " ", "Orgainising a stag/hen weekend or day? ", "Call our office on (01654) 767024 or 07960584861 for competitive prices. We can help you with accommodation and a great programme. ", "Adventure Family: ", "Get out and discover the great outdoors, spend time with your family, learn new skills and challenge yourselves with adventurous activities. ", "Adventure Weeks: ", "Designed to promote teamwork and leadership skills. Develops a healthier lifestyle and improves fitness, ideal for youth groups, cadet groups, scouts, guides and explorers.", "Adventure Business: ", "Corporate adventure packages for fun, team development and conferencing. ", "Adventure Schools: ", "Course’s designed for you to meet your aims and objectives. The use of the outdoors makes a major contribution to physical and environmental education and enhances many other curriculum areas. It contributes to personal growth and social awareness and develops skills for life and the working world.\r\n          "]},
{"addr": ["\r\n      The Harbour Masters Building, Out Harbour, Pwllheli, Gwynedd, LL53 5AU, Wales\r\n    "], "tel": ["\r\n          +44 01758 612850\r\n        "], "name": ["\r\n      Professional Powerboat Training\r\n    "], "catid": ["Index-101322143415%252c"], "site": ["http://www.professional-powerboat-training.co.uk"], "desc": ["\r\n            We are a dedicated Powerboat Training School providing training for all levels of ability in a professional, relaxed, atmosphere. RYA courses. State of the art equipment maintained to the highest standards.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670964\r\n        "], "name": ["\r\n      Plas Menai\r\n    "], "catid": ["Index-101322143415%252c"], "site": ["http://www.plasmenai.co.uk"], "desc": ["\r\n            Plas Menai is the National Watersports Centre based on the banks of the Menai Strait overlooking the Isle of Angelsey. Owned and operated by Sport Wales, the centre and facilities is set in four acres of landscaped grounds with a large waterfront and dedicated slipway. ", "The Centre is a recognised RYA and BCU training centre and offers technical courses in sailing, windsurfing, powerboating, cruising, kayaking and instructor training. During the summer holidays, Plas Menai runs a variety of youth actvity holidays for children aged between 8-17yrs. The centre also runs adventure activities for families, schools, groups and teambuilding events for corporate customers.", "The Centre can accommodate up to 100 people in comfortable twin-bedded ensuite rooms in the main complex and in our onsite dormitory style houses and is open throughout the year, (closed during the Christmas period).\r\n          "]},
{"addr": ["\r\n      Parc Gwledig Padarn, Llanberis, Caernarfon, Gwynedd, LL55 4TY, Wales\r\n    "], "tel": ["\r\n          +44 01286 870889\r\n        "], "name": ["\r\n      Vivian Diving Centre\r\n    "], "catid": ["Index-101322143512%252c"], "site": ["http://www.divevivian.com"], "desc": ["\r\n            Vivian Slate Quarry was last worked in 1958 and has since filled with water from run off's and it is also believed to be fed from underwater springs which connect it to Lake Padarn itself. ", "Being a slate quarry means clean, clear water with very little sediment. ", "  ", "The Diving Centre is set in a very picturesque location and offers safe, sheltered diving whatever the weather for all levels of diver.", "Vivian itself ranges from 6 to 18m deep and usually offers great visibility all year round. There is a platform anchored at 6m for training along with various things to see, such as trout, common eels, sunken boats, van, blast hut, house & gnome garden.\r\n          "]},
{"addr": ["\r\n      1 Thomas Buildings, New Street, Pwllheli, Gwynedd, LL53 5HH, Wales\r\n    "], "tel": [], "name": ["\r\n      Gone Swimming\r\n    "], "catid": ["Index-101322143512%252c"], "site": ["http://www.goneswimming.co.uk"], "desc": ["\r\n            Gone Swimming offer a range of wild swimming holidays based in various properties around Snowdonia and North Wales.  From short \"Wet Weekends\" to luxury \"Pleasure of Adventure\" trips - there is something for everyone.", "Gone Swimming specialises in relaxed holidays that put the emphasis on enjoying swimming rather than covering set distances. There is also quite a lot of emphasis on post-swim tea and cake.", "The Gone Swimming team are available for one day booking to provide swim guiding and specialist support.", "Ultimately, each wet weekend is different. On the Friday night, once everybody had arrived - we will sit down and figure out what YOU want to do. Obviously, it's a democratic process, and we cannot please everybody all of the time, but we aim to show you a good variety of the exceptional swims that we have to offer in North Wales.", "So depending on the groups wishes;", "- we could be going for long distance swims along beaches or around headlands,", "- we could be doing adventrous dips and exploring some of the nooks and crannies of the craggy Welsh coastline (probably not all 750 miles of it though)", "- we could be enjoying the sunshine (yes it does happen in Wales) on sandy beach and playing in the surf", "- we could be cruising down a river, going with the flow and seeing the world from a different angle, at a different pace", "- we could be scaling mountains to dip into hidden lakes, or bathe under mountain waterfalls", "or far more likely, we will be doing a combination of all of them.", "Wild swimming in Wales does not get much better", "The swims will be tailored to YOUR capabilities, and there is absolutely no pressure for people to be swimming laps of Anglesey. Each swim will be as long or as short as YOU want it to be. We always make sure that we have options at many of the venues we go to.", "It is a cliche these days, but safety is our number one priority. Dan has spent over a decade of his life working in the area of water safety, and there is simply no way that he will compromise on that. If the Gone Swimming team does not feel that it is safe to take you to a swim, then we will take you somewhere else.", "This is the huge advantage of having local guides, with local knowledge, and no fixed itinerary or journey to swim. If the wind is howling from one direction, we will be sure to know of some sheltered spots where we can still have a nice swim. Whatever the weather, we will have a few spots up our sleeve, and let's face it - you can only get soaked to the skin, no deeper. You're coming on a wet weekend in Wales - what do you expect?\r\n          "]},
{"addr": ["\r\n      Y Glyn, Llanberis, Gwynedd, LL55 4EL, Wales\r\n    "], "tel": ["\r\n          +44 01286 879001\r\n        "], "name": ["\r\n      Surf-Lines Adventures\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.surf-lines.co.uk"], "desc": ["\r\n            Surf-Lines provide canoeing, kayaking, climbing, coasteering, gorge scrambling, mountain walking, orienteering and team building. Our experienced instructors provide exciting 2hr, 1/2 day, full day and multi day activities. Looking to develop your paddle skills? Why not join us on one of our popular sea kayak, canoe or white water skills courses. ", "We also have North Wales' premier canoe and kayak retail outlet packed full of the latest boats and kit. Boat demo's are availible.\r\n          "]},
{"addr": ["\r\n      Min-y-don, Arthog, Fairbourne, Gwynedd, LL39 1BZ, Wales\r\n    "], "tel": ["\r\n          +44 01341 250433\r\n        "], "name": ["\r\n      Min-y-Don Christian Adventure Centre\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.minydon.com"], "desc": ["\r\n            Superbly situated on the shores of the Mawddach Estuary and set against the spectacular backdrop of the Cadair Mountain Range, MIN-Y-DON provides a unique setting for family and youth group holidays.", "ACTIVITIES AVAILABLE ON SITE:", "*Kayaking ", "*Canoeing ", "*Rock Climbing ", "*Abseiling ", "*Aerial Runway ", "*High and Low Ropes Courses ", "*Archery ", "*Orienteering ", "*Problem Solving and Team Building Games ", "*Treasure Hunts ", "*Min-Y-Don 'Safari' - (Environmental and Beach Studies) ", "*Crate Climbing ", "*Bushcraft ", "Many beautiful HILL WALKS are available throughout the adjacent countryside.\r\n          "]},
{"addr": ["\r\n      Ynys Fechan Hall, Arthog, Dolgellau, Fairbourne, Gwynedd, LL39 1YT, Wales\r\n    "], "tel": ["\r\n          +44 01341 250369\r\n        "], "name": ["\r\n      Crisis Care - Ynys Fechan Hall\r\n    "], "catid": ["Index-101322143514%252c"], "site": [], "desc": ["\r\n            Activity Centre\r\n          "]},
{"addr": ["\r\n      Clegy, Llanaelhaearn, Pwllheli, Gwynedd, LL54 5AD, Wales\r\n    "], "tel": ["\r\n          +44 07751 826714\r\n        "], "name": ["\r\n      Lleyn Adventure Activities\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.llynadventures.com"], "desc": ["\r\n            We provide fun, challenging and rewarding activities around the Peninsula from our base on the outskirts of Abersoch. Activities like Coasteering, Canyoning, Climbing and Abseiling or Mountain and Coastal Walks.\r\n          "]},
{"addr": ["\r\n      Bryn Du Mountain Centre, Ty Du Road, Llanberis, Gwynedd, LL55 4HE, Wales\r\n    "], "tel": ["\r\n          +44 01286 870556\r\n        "], "name": ["\r\n      Boulder Adventures Ltd\r\n    "], "catid": ["Index-101322143514%252c"], "site": [], "desc": ["\r\n            Boulder Adventures is based at the Bryn Du Mountain Centre and the Padarn Water Sports Centre in Llanberis, Snowdonia. The residential centre is a spacious Victorian house in its own gardens. The Water Sports Centre is located on the shores of Llyn Padarn accessed from the Welsh Slate Museum Car Park. We offer a variety of specialist courses and multi-activity trips, as well as courses tailored to your groups specific demands, placing particular emphasis on canoeing, kayaking, climbing, abseiling, gorge scrambling and walking. Courses can last from half a day to a week although the memories will be for longer.   Our experienced and fully trained staff ensure that your stay at Boulder Adventures is as safe and enjoyable as possible, allowing you to concentrate on the activities that brought you to the centre in the first place. For further details visit: www.boulderadventures.co.uk or www.adventuresinwales.co.uk\r\n          "]},
{"addr": ["\r\n      Bryn-y-moel, Llanbedr, Gwynedd, LL45 2HU, Wales\r\n    "], "tel": ["\r\n          +44 01341 241358\r\n        "], "name": ["\r\n      The Ranch Outdoor Discovery Centre\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.actioncentres.co.uk"], "desc": ["\r\n            The Ranch Outdoor Discovery Centre exists to offer young people opportunities for exciting residential experiences all year round in the heart of Snowdonia - with an emphasis on personal discovery, education, safety and fun!\r\n          "]},
{"addr": ["\r\n      Aberdyfi, Gwynedd, Aberdovey, Gwynedd, LL35 0RA, Wales\r\n    "], "tel": ["\r\n          +44 01654 767464\r\n        "], "name": ["\r\n      Outward Bound Wales Aberdovey\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.outwardbound-uk.org"], "desc": ["\r\n            Multi activity courses for individuals of one, two and three weeks in length. Course members join groups of 10-12 people under the guidance of a group instructor to have a highly memorable adventure. Specifically designed courses, which meet current educational initiatives, and curriculum objectives. They include A level PE: Vocational A levels; Raising Achievement; Key Skills, and adventure and challenge.\r\n          "]},
{"addr": ["\r\n      Plas Y Brenin, Capel Curig, Betws-y-coed, Conwy, LL24 0ET, Wales\r\n    "], "tel": ["\r\n          +44 01690 720214\r\n        "], "name": ["\r\n      Plas Y Brenin - National Mountain Centre\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.pyb.co.uk"], "desc": ["\r\n            Mountain Activity Centre run by the Mountain Training Trust. Plas Y Brenin offers a range of outdoor pursuit and activity courses for every level of expertise - hill walking, rock climbing, canoeing, kayaking, skiing, orienteering, mountain biking plus much, much more.\r\n          "]},
{"addr": ["\r\n      Beddgelert, Caernarfon, Gwynedd, LL55 4YF, Wales\r\n    "], "tel": ["\r\n          +44 01766 890233\r\n        "], "name": ["\r\n      Aberglaslyn Hall Outdoor Education\r\n    "], "catid": ["Index-101322143514%252c"], "site": [], "desc": ["\r\n            Aberglaslyn Hall is Leciestershires Outdoor Learning Centre. We can offer a full range of outdoor activities such as canoeing, kayaking, abseiling, coasteering, gorge walking as well as activities like rafting, field studies and team exercises.   The hall can accommodate up to 42 students and 6 staff.  Courses are usually residential but can also be run on a day visit basis.   All equipment is provided and the hall has three mini buses to transport all students.   Aberglaslyn is both AALS approved and has the Quality Badge from the Learning Outside the Classroom.   It is staffed by three fully qualified members of staff and can call on equally qualified members of staff should numbers dictate.     Contact Tel 01766 890233  Email aberglaslyn@beaumanor.rmplc.co.uk\r\n          "]},
{"addr": ["\r\n      Main Office, Beach Hut Area, Bennar Headland, Abersoch, Gwynedd, LL53 7DP, Wales\r\n    "], "tel": ["\r\n          +44 01758 712963\r\n        "], "name": ["\r\n      Abersoch Sailing School\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.abersochsailingschool.com"], "desc": ["\r\n            Watersports centre specialising in sailing, kayaking and rafting. Lessons available. Children and groups catered for. Boat hire also available including catamarans, speedboats, fun boats and canoes. March to November.\r\n          "]},
{"addr": ["\r\n      Bontddu, Barmouth, Gwynedd, LL42 1TH, Wales\r\n    "], "tel": ["\r\n          +44 01341 430276\r\n        "], "name": ["\r\n      Plas Caerdeon Outdoor Education Centre\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.hope.ac.uk/caerdeon/"], "desc": ["\r\n            Set in 18 acres of private, secluded woodlands within the Snowdonia National Park, overlooking the Mawddach Estuary, often described as one of the most beautiful in Britain.", "Teaching staff are fully qualified in canoeing, climbing, mountaineering and environmental sciences. ", "Catering: Fully flexible, from home-cooked meals to special dietary needs. ", "Equipment: Plas Caerdeon provides all specialist equipment and clothing. Other facilities include a purpose-built classroom with inter-active whiteboard and data projectors; teaching rooms, small library, computer suite and drying room. A fleet of minibuses provide daily transport for groups.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670964\r\n        "], "name": ["\r\n      Plas Menai\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.plasmenai.co.uk"], "desc": ["\r\n            Plas Menai is the National Watersports Centre based on the banks of the Menai Strait overlooking the Isle of Angelsey. Owned and operated by Sport Wales, the centre and facilities is set in four acres of landscaped grounds with a large waterfront and dedicated slipway. ", "The Centre is a recognised RYA and BCU training centre and offers technical courses in sailing, windsurfing, powerboating, cruising, kayaking and instructor training. During the summer holidays, Plas Menai runs a variety of youth actvity holidays for children aged between 8-17yrs. The centre also runs adventure activities for families, schools, groups and teambuilding events for corporate customers.", "The Centre can accommodate up to 100 people in comfortable twin-bedded ensuite rooms in the main complex and in our onsite dormitory style houses and is open throughout the year, (closed during the Christmas period).\r\n          "]},
{"addr": ["\r\n      Clynnog Fawr, Caernarfon, Gwynedd, LL54 5NS, Wales\r\n    "], "tel": ["\r\n          +44 01286 660202\r\n        "], "name": ["\r\n      Pathfinder Mountain Activities\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.pathfindersnowdonia.co.uk"], "desc": ["\r\n            Rock Climbing - Instruction of basic climbing techniques on a suitable crag, this activity includes climbs of enjoyable height and difficulty while safety roped. After the climb abseiling down is always great fun! We also try to teach you something of the skills of rope work and the use of modern climbing equipment.", "Mountaineering Walks - Snowdonia's mountains are very rugged, full of character, and can be a source of adventure. Learn something of their wild side by reaching high into their summits with an experienced guide. You will be rewarded with spectacular scenery if the weather is clear, and if not there is always a taste of that \"Special atmosphere\".", "Mountain Scrambling - To reach famous summits by interesting and challenging routes must be the most satisfying of all mountain activities. Moving roped or un-roped over high and exposed rocky terrain really does build confidence and always proves very exciting! Among these come such classics as Crib Goch, or the North Ridge of Tryfan, and Bristly Ridge. Very famous, very hairy and very exciting. And yet quite within your grasp with us.", " ", "Navigation Training & Orienteering - For the budding mountaineer or team leader this will prove invaluable. The absolute necessity of knowing where you are by day or nigh, cloud or whiteout, is a must! Learn to find your way around with serious mountain training, or make it educational fun with a leisurely orienteering course, Learn how to read a Map and use a Compass effectively, and we can even show you how to navigate by satellite.\r\n          "]},
{"addr": ["\r\n      2/1 Goronwy Street, Gerlan, Bethesda, Gwynedd, LL57 3TS, Wales\r\n    "], "tel": ["\r\n          +44 01248 601302\r\n        "], "name": ["\r\n      Sea 2 Summit\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.sea2summit.net"], "desc": ["\r\n            Sea 2 Summit offers a range of personalised courses for novices and experts alike in Rock Climbing, Kayaking, Mountain Walking & Coasteering. We provide private courses tailored to your needs or open courses on set dates. Bookings can be made by individuals or small groups; we also cater for school groups providing an education programme. Based in the heart of Snowdonia, North Wales, there is no better location, with easily accessible scrambles, world renowned cliff faces and beautiful scenery.\r\n          "]},
{"addr": ["\r\n      3 - 4 Bath Place, Aberdyfi, Aberdovey, Gwynedd, LL35 0LN, Wales\r\n    "], "tel": ["\r\n          +44 01654 767024\r\n        "], "name": ["\r\n      Adventure Camps\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.adventurecamps.co.uk"], "desc": ["\r\n            Nothing beats the thrill of mountain-biking down some of the UK's most famous mountain bike trails. And virtually nothing beats canyoning down some of Wales best kept secret rivers. Very little beats a multi-activity day of climbing, walking, canoeing, surfing and raft-building. Top this off by camping on a Welsh cliff top watching the sun going down over the spectacular Cardigan Bay whilst enjoying a barbecue.", "Adventure Camps is one of the UK's leading specialist outdoor centres with some of the finest outdoor terrain on its doorstep in the magnificent Snowdonia National Park, Wales. ", "Adventure Camps; Safety, Adventure, Enjoyment, Learning, Challenge… ", "Adventure Camps provide a range of quality, value for money courses such as; ", "Adventure Weekends: ", "Get away from it all and reinvigorate yourself and your group of friends; a great way to celebrate events of all types. ", " ", "Orgainising a stag/hen weekend or day? ", "Call our office on (01654) 767024 or 07960584861 for competitive prices. We can help you with accommodation and a great programme. ", "Adventure Family: ", "Get out and discover the great outdoors, spend time with your family, learn new skills and challenge yourselves with adventurous activities. ", "Adventure Weeks: ", "Designed to promote teamwork and leadership skills. Develops a healthier lifestyle and improves fitness, ideal for youth groups, cadet groups, scouts, guides and explorers.", "Adventure Business: ", "Corporate adventure packages for fun, team development and conferencing. ", "Adventure Schools: ", "Course’s designed for you to meet your aims and objectives. The use of the outdoors makes a major contribution to physical and environmental education and enhances many other curriculum areas. It contributes to personal growth and social awareness and develops skills for life and the working world.\r\n          "]},
{"addr": ["\r\n      Llwyngwril, Gwynedd, Barmouth, Gwynedd, LL37 2QB, Wales\r\n    "], "tel": [], "name": ["\r\n      Canolfan Ty Gwyn\r\n    "], "catid": ["Index-101322143514%252c"], "site": [], "desc": ["\r\n            Ty Gwyn Outdoor Centres offers a wide range of residential and non-residential outdoor activities courses for all. We operate a range of activities and include canoeing, sailing, kayaking, climbing, abseiling, sailing, raft building, mountain walking, orienteering and mountain biking.", "In addition, we are able to offer skills based courses in mountain navigation, expeditioning, rock climbing and the Single Pitch Award, OTC mountain bike courses, sailing kayaking and canoeing.", "During the holidays we have activity days on offer to come and try out a sport, or if a group would like to book in for a day of fun, this is also possible.", "If you wish to have a group residential course, then Ty Gwyn can comfortably accommodate 30. All food can be provided and is good quality and freshly cooked.\r\n          "]},
{"addr": ["\r\n      Llanuwchllyn, Y Bala, Bala, Gwynedd, LL23 7ST, Wales\r\n    "], "tel": ["\r\n          +44 01678 541000\r\n        "], "name": ["\r\n      Gwersyll yr Urdd Glan-Llyn\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://Urdd.org/glanllyn"], "desc": ["\r\n            Gwersyll yr Urdd Glan-llyn is a multi activity centre situated on the shores of Llyn Tegid, near Y Bala, a mile from the village of Llanuwchllyn in the shadow of the Aran and within Eryri, Snowdonia National Park. It is an ideal location for all types of holidays and activity courses.\r\n          "]},
{"addr": ["\r\n      Pentre Bach, Waunfawr, Caernarfon, Gwynedd, LL54 7AJ, Wales\r\n    "], "tel": ["\r\n          +44 01286 650643\r\n        "], "name": ["\r\n      Bach Ventures Ltd\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://bachventures.co.uk"], "desc": ["\r\n            Looking for a new experience or want to broaden your current knowledge? We can help provide you with that opportunity, so whether you wish to be guided around the hills, try kayaking, climbing or gorge scrambling we're happy to oblige!\r\n          "]},
{"addr": ["\r\n      Hafan Pwllheli (marina), Glan Don, Pwllheli, Gwynedd, LL53 7RS, Wales\r\n    "], "tel": ["\r\n          +44 01758 613000\r\n        "], "name": ["\r\n      Shearwater Coastal Cruises\r\n    "], "catid": ["Index-101520093023%252c"], "site": ["http://www.shearwatercruises.com"], "desc": ["\r\n            Scenic coastal cruises from Pwllheli Marina visiting seal and seabird colonies. We are regularly joined by the resident dolphins who we monitor for marine scientific organisations. Bookings through Pwllheli Tourist Information Centre.\r\n          "]},
{"addr": ["\r\n      Dinorwic, Caernarfon, Caernarfon, Gwynedd, LL55 3ET, Wales\r\n    "], "tel": ["\r\n          +44 01286 870853\r\n        "], "name": ["\r\n      Blue Peris Mountain Centre\r\n    "], "catid": ["Index-101322143514%252c"], "site": ["http://www.blueperis.co.uk"], "desc": ["\r\n            An ex-employee once said 'We Do Everything!' Almost all our activities take place off-site in 'real' adventure venues. This requires a higher skill and qualification level from our instructors but greatly enhances the adventure.\r\n          "]},
{"addr": ["\r\n      Morgan James, 2 Charter Boat, Y Felinheli, Gwynedd, LL56 4YJ, Wales\r\n    "], "tel": [], "name": ["\r\n      Morgan James 2 Charter Boat\r\n    "], "catid": ["Index-101520093023%252c"], "site": ["http://www.morganjames2.co.uk"], "desc": ["\r\n            Morgan James II is an 11 metre South Boat Catamaran purpose built for angling and powered by two 300hp Cummins engines capable of 26 knots and a comfortable cruising speed of 18 knots. She is fully equipped with all the latest electronics and safety gear and licensed for up to 60 miles day or night. On deck she is fitted out with 2 live bait tanks, insulated fish hold for the 2 - 5 day Isle of Man trips, bait cutting tables and easy access toilet.\r\n          "]},
{"addr": ["\r\n      Bryn Gwyltt, Trefriw, Conwy, LL24 0AN, Wales\r\n    "], "tel": ["\r\n          +44 07511 749673\r\n        "], "name": ["\r\n      Snowdonia Safaris\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.snowdoniasafaris.co.uk"], "desc": ["\r\n            Maybe it's your first time in Wales? ", "Want to see more than the usual tourist attractions on offer in North Wales?", "Only have a few days? ", "Want to see hidden Snowdonia?", "Don't know the area? ", "Need inside local knowledge?", "Then look no further than Wales' 'Snowdonia Safaris' tours in a 4 x 4 vehicle. You will be well looked after by a well travelled local guide who has extensive knowledge of Snowdonia and North Wales. ", "Whether its castles, ancient chapels & neolithic tombs;", "Mountain passes, hidden lakes and forests; ", "Old quarries, lost villages and historic sites; ", "Snowdonia Safaris knows all the hidden gems in Snowdonia and has tours to suit your requirements.'Hidden Gems of Snowdonia'Tours include:", " - \"\"\"\"Passes to Peninsula\"\"\"\"", " - \"\"\"\"Lost Quarries and Villages\"\"\"\"", " - \"\"\"\"Tombs and Views' ", " - \"\"\"\"Bespoke tours\"\"\"\" - tailor made to suit ", " your needs.", "All tours require a small amount of walking to get to the sites.", "Please bring suitable footwear and all -weather gear.", "Low level guided walks can be included in the tour if you wish. ", "Half or whole day available. ", "Snowdonia Safaris is based in Betws-y-Coed, North Wales, The Gateway to Snowdonia and is run by Bernard Owen who has extensive, local knowledge of the area and many years experience in tourism within North Wales.", "Snowdonia Safaris offer:", "A Personal service ", "Tours available for 1 - 4 people maximum in a 4x4 vehicle", "Groups catered for - contact us for details", "Free pick ups and drop off's from holiday accommodation within 6 mile radius of Betws-y-Coed, The Gateway to Snowdonia.", "Also from Llandudno and other areas outside the National Park by arrangement", "Transfers can be arranged from local stations & North West Airports", "English, French and Welsh spoken.\r\n          "]},
{"addr": ["\r\n      1 Pant Y Carw, Nant Y Felin Rd, Llanfairfechan, Conwy, LL33 0SU, Wales\r\n    "], "tel": ["\r\n          +44 01248 681357\r\n        "], "name": ["\r\n      expeditionguide.com\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.expeditionguide.com"], "desc": ["\r\n            A range of hillwalking, mountaineering and climbing courses are run throughout the year to help you become self sufficient in the mountains and on the crags.\r\n          "]},
{"addr": ["\r\n      4 New Street, Deiniolen, Caernarfon, Gwynedd, LL55 3LH, Wales\r\n    "], "tel": ["\r\n          +44 01248 490188\r\n        "], "name": ["\r\n      Snowdonia Adventures\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.snowdonia-adventures.co.uk"], "desc": ["\r\n            Snowdonia Adventures is an established company who have been providing outdoor activities and skills courses to individuals and groups since 2000.", "We provide fun outdoor activities to individuals and groups. Our speciality is offering personally tailored skills courses for walkers,climbers and mountaineers.", "The company is owned and run by its directors Mark Handford and Shan Rees Roberts.\r\n          "]},
{"addr": ["\r\n      4 New Street, Deiniolen, Caernarfon, Gwynedd, LL55 3LH, Wales\r\n    "], "tel": ["\r\n          +44 01286 879044\r\n        "], "name": ["\r\n      Snowdonia Navigation\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.snowdonia-navigation.co.uk"], "desc": ["\r\n            Snowdonia Navigation was formed in 2006 by Mark Handford and Shân Rees Roberts who run the successful adventure activity company Snowdonia Adventures.", "We wanted to provide essential skills for walkers and mountaineers to help reduce the accidents that happen every year in the mountains of North Wales and decided to provide a dedicated company to give the best possible learning experience for all levels of ability. We pride ourselves on being able to not only provide structured certificated and non certificated courses but also bespoke tailored courses to meet your needs.\r\n          "]},
{"addr": ["\r\n      Ty Hyll, Capel Curig, Conwy, LL24 0DS, Wales\r\n    "], "tel": ["\r\n          +44 01690 720287\r\n        "], "name": ["\r\n      Snowdonia Society - Cymdeithas Eryri\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.snowdonia-society.org.uk"], "desc": ["\r\n            Join us to help make it a reality! We undertake conservation and enhancement work in the National Park; monitor management and planning policies; make recommendations to the relevant bodies and undertake lobbying and campaigning work where appropriate; and promote access and enjoyment for all in Snowdonia.", "The Snowdonia Society would like to see a National Park in which the unique and irreplaceable qualities, on which the economy depends, are proudly protected by thriving and cohesive communities that have adapted to climate change.\r\n          "]},
{"addr": ["\r\n      29 Braichmelyn, Bethesda, Gwynedd, LL57 3RD, Wales\r\n    "], "tel": ["\r\n          +44 015394 42593\r\n        "], "name": ["\r\n      Ascents of Adventure\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.ascentsofadventure.co.uk"], "desc": ["\r\n            Ascents of Adventure is run by me, Andy Bruce. I run personalised hill walking, scrambling, rock climbing and navigation courses providing instruction and guided days out in the stunning mountains of the Snowdonia. ", "When the weather is cold and gloomy in the UK I run rock climbing holiday courses to sunny Sardinia. Whatever your current level of skill or future aspirations, I will tailor-make a walking, scrambling or rock climbing experience to suit your needs.", "Maybe you have never climbed before and want a single day's taster of this fantastic sport. Maybe you already have some rock climbing experience and want a week's course on the classic rock routes of the Lake District to develop your skills further. Maybe you want to hone your navigation or scrambling skills so that you can take your outdoor adventures to the next level. Or maybe you want to give a weekend's guided walking in the Lake District to someone as a gift.", "I hold the Mountain Instructor Award, the highest summer rock climbing qualification in the UK, so you'll be in safe hands and I have been instructing for over 20 years. I am a member of the Association of Mountaineering Instructors.", "I don't believe in hidden costs, so if you need to borrow rock climbing shoes, harness or helmet on a scrambling or rock climbing course, there is no extra charge for this.\r\n          "]},
{"addr": ["\r\n      Bryn-y-moel, Llanbedr, Gwynedd, LL45 2HU, Wales\r\n    "], "tel": ["\r\n          +44 01341 241358\r\n        "], "name": ["\r\n      The Ranch Outdoor Discovery Centre\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.actioncentres.co.uk"], "desc": ["\r\n            The Ranch Outdoor Discovery Centre exists to offer young people opportunities for exciting residential experiences all year round in the heart of Snowdonia - with an emphasis on personal discovery, education, safety and fun!\r\n          "]},
{"addr": ["\r\n      Bontddu, Barmouth, Gwynedd, LL42 1TH, Wales\r\n    "], "tel": ["\r\n          +44 01341 430276\r\n        "], "name": ["\r\n      Plas Caerdeon Outdoor Education Centre\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.hope.ac.uk/caerdeon/"], "desc": ["\r\n            Set in 18 acres of private, secluded woodlands within the Snowdonia National Park, overlooking the Mawddach Estuary, often described as one of the most beautiful in Britain.", "Teaching staff are fully qualified in canoeing, climbing, mountaineering and environmental sciences. ", "Catering: Fully flexible, from home-cooked meals to special dietary needs. ", "Equipment: Plas Caerdeon provides all specialist equipment and clothing. Other facilities include a purpose-built classroom with inter-active whiteboard and data projectors; teaching rooms, small library, computer suite and drying room. A fleet of minibuses provide daily transport for groups.\r\n          "]},
{"addr": ["\r\n      6 New Street, Aberdovey, Gwynedd, LL35 0EH, Wales\r\n    "], "tel": ["\r\n          +44 01654 767655\r\n        "], "name": ["\r\n      Adrenalin Antics\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.adrenalinantics.com"], "desc": ["\r\n            Activity centre providing a wide range of activities including Kayaking, canoeing, mountain biking, rock climbing and more. All activities are led by fully qualified instructors.\r\n          "]},
{"addr": ["\r\n      Plas Y Brenin, Capel Curig, Betws-y-coed, Conwy, LL24 0ET, Wales\r\n    "], "tel": ["\r\n          +44 01690 720214\r\n        "], "name": ["\r\n      Plas Y Brenin - National Mountain Centre\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.pyb.co.uk"], "desc": ["\r\n            Mountain Activity Centre run by the Mountain Training Trust. Plas Y Brenin offers a range of outdoor pursuit and activity courses for every level of expertise - hill walking, rock climbing, canoeing, kayaking, skiing, orienteering, mountain biking plus much, much more.\r\n          "]},
{"addr": ["\r\n      Clegy, Llanaelhaearn, Pwllheli, Gwynedd, LL54 5AD, Wales\r\n    "], "tel": ["\r\n          +44 07751 826714\r\n        "], "name": ["\r\n      Lleyn Adventure Activities\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.llynadventures.com"], "desc": ["\r\n            We provide fun, challenging and rewarding activities around the Peninsula from our base on the outskirts of Abersoch. Activities like Coasteering, Canyoning, Climbing and Abseiling or Mountain and Coastal Walks.\r\n          "]},
{"addr": ["\r\n      Llanuwchllyn, Y Bala, Bala, Gwynedd, LL23 7ST, Wales\r\n    "], "tel": ["\r\n          +44 01678 541000\r\n        "], "name": ["\r\n      Gwersyll yr Urdd Glan-Llyn\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://Urdd.org/glanllyn"], "desc": ["\r\n            Gwersyll yr Urdd Glan-llyn is a multi activity centre situated on the shores of Llyn Tegid, near Y Bala, a mile from the village of Llanuwchllyn in the shadow of the Aran and within Eryri, Snowdonia National Park. It is an ideal location for all types of holidays and activity courses.\r\n          "]},
{"addr": ["\r\n      Bryn Cadfan, Rhosgadfan, Caernarfon, Gwynedd, LL54 7HH, Wales\r\n    "], "tel": ["\r\n          +44 01286 831559\r\n        "], "name": ["\r\n      Wild About Wales\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.wild-about-wales.co.uk"], "desc": ["\r\n            Guided mountain walking and scrambling. At Wild About Wales we offer day walks or more challenging treks, long weekends and full week guided walking holidays in Snowdonia, North Wales. Additionally we provide multi-activity sessions including rock climbing, abseiling, canoeing, coasteering and cater for stag and hen parties.\r\n          "]},
{"addr": ["\r\n      Corris Uchaf, Machynlleth, Gwynedd, SY20 9RH, Wales\r\n    "], "tel": ["\r\n          +44 01654 761678\r\n        "], "name": ["\r\n      Ty'n y Berth Mountain Centre\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.widehorizons.org.uk"], "desc": ["\r\n            We provide high quality Outdoor Learning courses to Schools, Colleges and Youth groups. We also provide leadership training and development courses and MLTE training and assessment courses for teachers and youth leaders.\r\n          "]},
{"addr": ["\r\n      2/1 Goronwy Street, Gerlan, Bethesda, Gwynedd, LL57 3TS, Wales\r\n    "], "tel": ["\r\n          +44 01248 601302\r\n        "], "name": ["\r\n      Sea 2 Summit\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.sea2summit.net"], "desc": ["\r\n            Sea 2 Summit offers a range of personalised courses for novices and experts alike in Rock Climbing, Kayaking, Mountain Walking & Coasteering. We provide private courses tailored to your needs or open courses on set dates. Bookings can be made by individuals or small groups; we also cater for school groups providing an education programme. Based in the heart of Snowdonia, North Wales, there is no better location, with easily accessible scrambles, world renowned cliff faces and beautiful scenery.\r\n          "]},
{"addr": ["\r\n      Clynnog Fawr, Caernarfon, Gwynedd, LL54 5NS, Wales\r\n    "], "tel": ["\r\n          +44 01286 660202\r\n        "], "name": ["\r\n      Pathfinder Mountain Activities\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.pathfindersnowdonia.co.uk"], "desc": ["\r\n            Rock Climbing - Instruction of basic climbing techniques on a suitable crag, this activity includes climbs of enjoyable height and difficulty while safety roped. After the climb abseiling down is always great fun! We also try to teach you something of the skills of rope work and the use of modern climbing equipment.", "Mountaineering Walks - Snowdonia's mountains are very rugged, full of character, and can be a source of adventure. Learn something of their wild side by reaching high into their summits with an experienced guide. You will be rewarded with spectacular scenery if the weather is clear, and if not there is always a taste of that \"Special atmosphere\".", "Mountain Scrambling - To reach famous summits by interesting and challenging routes must be the most satisfying of all mountain activities. Moving roped or un-roped over high and exposed rocky terrain really does build confidence and always proves very exciting! Among these come such classics as Crib Goch, or the North Ridge of Tryfan, and Bristly Ridge. Very famous, very hairy and very exciting. And yet quite within your grasp with us.", " ", "Navigation Training & Orienteering - For the budding mountaineer or team leader this will prove invaluable. The absolute necessity of knowing where you are by day or nigh, cloud or whiteout, is a must! Learn to find your way around with serious mountain training, or make it educational fun with a leisurely orienteering course, Learn how to read a Map and use a Compass effectively, and we can even show you how to navigate by satellite.\r\n          "]},
{"addr": ["\r\n      Tan Yr Allt, Fachwen, Llanberis, Gwynedd, LL55 3HB, Wales\r\n    "], "tel": ["\r\n          +44 01286 872684\r\n        "], "name": ["\r\n      Climb-Mountains\r\n    "], "catid": ["Index-101321173346%252c"], "site": ["http://www.climb-mountains.com"], "desc": ["\r\n            Climb-Mountains is a small independent company based in Snowdonia, North Wales that promises to provide high quality, inspirational and exciting guiding and instruction for rock climbing and mountaineering in some of the most dramatic landscapes in the British Isles. Whether you are a complete beginner looking to try something new, an experienced climber or mountaineer looking to acquire new skills or an outdoor enthusiast seeking assistance to achieve a long-held ambition we are happy to help. We have a deep passion for rock climbing and mountaineering and the challenge and reward that they offer and we aim to pass these experiences and opportunities on to you.\r\n          "]},
{"addr": ["\r\n      Arthog, Gwynedd, Fairbourne, Gwynedd, LL39 1BX, Wales\r\n    "], "tel": ["\r\n          +44 01341 250455\r\n        "], "name": ["\r\n      Shropshire Outdoor Education\r\n    "], "catid": ["Index-101321173346%252c"], "site": [], "desc": ["\r\n            No description available\r\n          "]},
{"addr": ["\r\n      Eryri Leisure Cyf, Zone 6, Cibyn Industrial Estate, Caernarfon, Gwynedd, LL55 2BD, Wales\r\n    "], "tel": ["\r\n          +44 01286 669515\r\n        "], "name": ["\r\n      Redline Indoor Karting\r\n    "], "catid": ["Index-101321143411%252c"], "site": ["http://www.redlineindoorkarting.co.uk"], "desc": ["\r\n            Experience the heart-pumping thrill of indoor kart racing in this brand new state of the art centre. We offer many different options for arrive-and-drive racing as well as endurance and heats competitions. Call us to reserve your next race.", "Minimum age = 8", "Minimum height = 135cm\r\n          "]},
{"addr": ["\r\n      Snowdonia National Park Centre, Maentwrog, Blaenau Ffestiniog, Gwynedd, LL41 3YU, Wales\r\n    "], "tel": ["\r\n          +44 01766 772600\r\n        "], "name": ["\r\n      Plas Tan y Bwlch\r\n    "], "catid": ["Index-101520163302%252c"], "site": ["http://www.plastanybwlch.com"], "desc": ["\r\n            The Centre aims to provide courses which are of interest to all lovers of the countryside who would like to know about this fascinating area of Wales.", "Plas Tan y Bwlch occupies a superb position overlooking the valley of the river Dwyryd in the heart of the National Park. No part of the Park is more than an hour’s drive away and some of the most spectacular scenery in Britain is within easy reach. From the heights of Snowdon, Cadair Idris and the bleak moors of Migneint, the hills stretch down through secluded valleys with their wooded slopes and placid lakes down to the sea. Among them are many places of great botanical, geological and historical interest, and these are the raw materials of the courses which are organised for you at the Study Centre.\r\n          "]},
{"addr": ["\r\n      Llwyngwril, Gwynedd, Barmouth, Gwynedd, LL37 2QB, Wales\r\n    "], "tel": [], "name": ["\r\n      Canolfan Ty Gwyn\r\n    "], "catid": ["Index-101321173346%252c"], "site": [], "desc": ["\r\n            Ty Gwyn Outdoor Centres offers a wide range of residential and non-residential outdoor activities courses for all. We operate a range of activities and include canoeing, sailing, kayaking, climbing, abseiling, sailing, raft building, mountain walking, orienteering and mountain biking.", "In addition, we are able to offer skills based courses in mountain navigation, expeditioning, rock climbing and the Single Pitch Award, OTC mountain bike courses, sailing kayaking and canoeing.", "During the holidays we have activity days on offer to come and try out a sport, or if a group would like to book in for a day of fun, this is also possible.", "If you wish to have a group residential course, then Ty Gwyn can comfortably accommodate 30. All food can be provided and is good quality and freshly cooked.\r\n          "]},
{"addr": ["\r\n      Gwynfryn Lodge, Llanystumdwy, Criccieth, Gwynedd, LL52 0LR, Wales\r\n    "], "tel": ["\r\n          +44 01766 523119\r\n        "], "name": ["\r\n      Segway X2 Adventures\r\n    "], "catid": ["Index-101321143411%252c"], "site": ["http://www.dragonraiders.co.uk"], "desc": ["\r\n            Come and enjoy the thrill and excitement of gliding on a Segway X2 at Dragon Raiders Activity Park. It's sleek, tough and provides you with a unique smooth driving experience like no other, designed to put a smile on your face!\r\n          "]},
{"addr": ["\r\n      Fron Deg, Rhosgadfan, Caernarfon, Gwynedd, LL54 7HR, Wales\r\n    "], "tel": ["\r\n          +44 01286 831818\r\n        "], "name": ["\r\n      Welsh Dragon Tours\r\n    "], "catid": ["Index-101520163302%252c"], "site": ["http://www.welshdragontours.com"], "desc": ["\r\n            2014 marks WELSH DRAGON TOURS tenth season, and we find ourselves wondering where a decade has gone. We may look a little older, a little grey here and there, but happily, Caernarfon Castle (a new viewing platform at The Queen's Gate) and Snowdon (The new summit complex) have barely changed since we escorted our first clients around the most beautiful region, in the most beautiful country in the British Isles. It still gives us a slightly guilty kick to hear the \"oohs\" and \"aahs\" from visitors, having been convinced (lets face it, by consistently good marketing) that their origins lie firmly rooted in 'The Emerald Isle', even if their family names are Jones or Williams! Of course, many of our visitors have always known of their Welsh heritage, have done their research, and it is very rewarding, and touching, for us to help someone locate their ancestor's last resting place, a former family home, or even a relative who is still in the land of the living, and they may never have met..", "The natural scenery and terrain of Snowdonia and Anglesey provide some of the finest and most challenging outdoor activity in the World, and the sector should receive every support in continuing to meet the demand,  but not everyone comes with hiking boots and a mountain bike. More and more people from overseas, who are looking for an alternative to the large coach vacation, enjoy what we do for them. They want to travel at their own pace, in a small group, or simply with their family, and, often, visit places of personal importance that are not covered by our standard itineraries. If this is their agenda, we build an achievable, first class programme around their priorities, with the level of accommodation they want, from the homely and informal  Bed and Breakfast guesthouse to five star country houses, all of which are our partners in making our client's Welsh experience memorable for all the right reasons. From one to ten days, we have a tour for you.", "Check us out at www.welshdragontours.com , and please read the testimonials from some of the lovely people we have toured with over the years. To borrow a line from one of our motoring organizations, we may not be the biggest, but we are determined to be the best.\r\n          "]},
{"addr": ["\r\n      Cilan Fawr, Cilan, Abersoch, Gwynedd, LL53 7DD, Wales\r\n    "], "tel": ["\r\n          +44 01758 713276\r\n        "], "name": ["\r\n      Cilan Riding Centre\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.abersochholidays.net"], "desc": ["\r\n            All the activities associated with a coastal holiday resort are available at their very best, at Abersoch. These include sailing, surfing, swimming, fishing, golfing, rambling, horse riding and cycling, to name but a few.\r\n          "]},
{"addr": ["\r\n      Y Bwthyn, 6 Waen Wen, Bangor, Gwynedd, LL57 4UF, Wales\r\n    "], "tel": ["\r\n          +44 01248 352402\r\n        "], "name": ["\r\n      Country Lane Tours\r\n    "], "catid": ["Index-101520163302%252c"], "site": ["http://www.countrylanetours.com"], "desc": ["\r\n            In addition to personalised, bespoke and chartered tours we also have our own tour programme with regular departure dates, please see our website for full information. These ‘Small Group’ tours include our “Village Life in Wales” a popular 8 day tour programme centred in either Snowdonia or the Llyn Peninsula and our “Land of my Fathers” tour which is a comprehensive 12 day tour of Wales.\r\n          "]},
{"addr": ["\r\n      1 Prospect Place, South Woodford, Aberdyfi, Aberdovey, Gwynedd, LL35 0EY, Wales\r\n    "], "tel": ["\r\n          +44 07850 031644\r\n        "], "name": ["\r\n      Venturers Norfolk Broads Cruise\r\n    "], "catid": ["Index-101520093023%252c"], "site": ["http://www.venturers.org.uk"], "desc": ["\r\n            What is the Venturers Cruise?", "The Venturers Cruise is an annual sailing holiday for young people. It was started over sixty years ago and is run by a Christian trust whose members are committed to the task of demonstrating the relevance of their faith to young people, within the beautiful but physically challenging environment of the Norfolk Broads.", "- We explore about sixty miles of the northern rivers and broads of Norfolk, from the wild exposure of Horsey Mere and Barton Broad to the quiet and picturesque villages of Horning and Irstead. ", "- Each yacht is in the charge of an experienced and competent skipper who is assisted by a first mate. ", "- The Venturers Cruise is licensed by the Adventure Activities Licensing Authority, and is a registered charity. ", "- Each yacht has four or five crew members who sleep and eat aboard and learn the skills of handling yachts and lugsail dinghies under the careful supervision of their skippers. ", "- Each evening the flotilla of up to eleven thirty-foot yachts, three motor cruisers and thirteen dinghies moors for dinner (cooked on board) and then everyone goes off to enjoy the nightly live entertainment (provided by you!) in a local village hall. The evening includes instruction on sailing basics and water safety. A live band and a relevant talk about Christianity are also included. ", "- Many young people coming on the Venturers Cruise have felt their lives greatly influenced by the experience. All have become more self-reliant and many have found a faith upon which to build their adult lives.\r\n          "]},
{"addr": ["\r\n      Bwlchgwyn, Aberdyfi, Aberdovey, Gwynedd, LL35 0SG, Wales\r\n    "], "tel": ["\r\n          +44 01654 768109\r\n        "], "name": ["\r\n      The Yard\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.retiredhorselivery.co.uk"], "desc": ["\r\n            The Yard Managed by Rachel Davies.", "Rachel has been riding since the age of three and is a qualified BHS instructor and can take freelance lessons and teach from the yard. Rachel also successfully produces ponies for breaking, schooling and showing ", "On behalf of clients this season, she is currently producing for the show ring Section C gelding, 'Peasedown Diplomat' ", "She is also schooling a young Section D stallion who may be for sale later this year.  ", "Please ring for enquiries regarding schooling/show production", "Please ring for costs of lessons and Yard services. Click here to contact the Yard.", "Achievements in 2009 see our news page by clicking here.", "Historic Achievements in 2005 included:", "3 supreme championships including qualification for PUK and BSPS", "2 reserve  supreme championships", "7  championships", "5 reserve championships ", "24 firsts", "Twice county champion and winner of two welsh cob performance medals", "In 2006 the partnership have qualified for NPS Summer championships", "Rachel produces for the sale and show ring, please check the Yard news for regular information regarding current showing activities and availability of horses or ponies for sale on behalf of clients", "Facilities available at the Yard include", "* DIY, part or full livery at our BHS approved yard", "* B and B for Horses Call Rachel for horse b&b details.", "* 40 X 20 sand and rubber ménage", "* Production of horses and ponies for show and sale", "* Breaking and schooling", "* Excellent off road hacking and beach riding\r\n          "]},
{"addr": ["\r\n      Ty Coch Farm, Penmachno, Betws-y-coed, Conwy, LL25 0HJ, Wales\r\n    "], "tel": ["\r\n          +44 01690 760248\r\n        "], "name": ["\r\n      Gwydir Stables Ltd\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.horse-riding-wales.co.uk"], "desc": ["\r\n            The riding centre at Gwydyr Stables (formerly Ty Coch) was established in 1973 and offers a wonderful location for horse riding, pony trekking or extended day trail rides. ", "We are situated 4 miles from Betws y Coed and surrounded by National Trust and Forestry Commission land. It provides breathtaking scenery in which to enjoy the excellent views across the Snowdonia Mountains.", "Individuals or groups are catered for by a team of experienced staff conducting rides on a variety of over 30 horses that range in size and ability from novice treks to experienced rides. ", "The staff have to undergo continuous development especially on safety issues including first aid and riding qualifications. Radio contact is maintained with the centre during treks.", "Rides are available throughout the year from a half-hour to full day, including summer evenings. Why not try our celebrated pub ride? Also available is our two or three-day trail rides around the area, with either camping, bunkhouse, B & B or hotel accommodation to chose from.\r\n          "]},
{"addr": ["\r\n      Waunfawr, Caernarfon, Caernarfon, Gwynedd, LL55 4PQ, Wales\r\n    "], "tel": ["\r\n          +44 01286 650342\r\n        "], "name": ["\r\n      Snowdonia Riding Stables\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.snowdoniaridingstables.co.uk"], "desc": ["\r\n            Located in North Wales between Snowdon and the sea, Snowdonia Riding Stables offers you superb riding amongst some of the best mountain and coastal scenery in the British Isles, whether you are a complete beginner or a competent rider.", "With miles of traffic free bridleways we have access through spectacular scenery amongst the foothills of Snowdon. ", "We have carefully selected horses and ponies to provide a range of sizes, types and temperaments to suit riders all abilities (or none at all!) ", "We have been established over 30 years with a wealth of experience, and some of our customers are third generation! ", "Snowdonia Riding Stables is an approved British Horse Society Riding School and Trekking Centre and is approved by the Pony Club.\r\n          "]},
{"addr": ["\r\n      High Street, Llanberis, Gwynedd, LL55 4SU, Wales\r\n    "], "tel": ["\r\n          +44 01286 870277\r\n        "], "name": ["\r\n      Dolbadarn Pony Trekking Centre\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.dolbadarnhotel.co.uk"], "desc": ["\r\n            One/two hour, half and full day treks on the foothills of Snowdon. Riding holidays can also be arranged. We cater from novice to experienced alike.\r\n          "]},
{"addr": ["\r\n      Llannerch Farm, Porthmadog, Gwynedd, LL49 9UR, Wales\r\n    "], "tel": ["\r\n          +44 01766 512468\r\n        "], "name": ["\r\n      Porthmadog Activity Centre\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://porthmadog-activity-centre.co.uk"], "desc": ["\r\n            A complete range of services we can offer you for  that special holiday or family day out. For more  serious riders we offer trekking holidays, you  can even bring your own horse (we will provide stable and livery) and stay on our 250 acre site, and enjoy the miles of off road trekking with stunning views that we have to offer. ", "For those more mechanically minded we also offer Junior Quad biking on our own circuit, a Bunnyland where you can meet he pets here at the centre, together with the usual light refreshments.\r\n          "]},
{"addr": ["\r\n      Arthog, Gwynedd, Fairbourne, Gwynedd, LL39 1BX, Wales\r\n    "], "tel": ["\r\n          +44 01341 250455\r\n        "], "name": ["\r\n      Arthog Outdoor Education Centre\r\n    "], "catid": ["Index-101321143402%252c"], "site": ["http://www.arthog.co.uk"], "desc": ["\r\n            Arthog Outdoor Education Centre is a residential outdoor education centre in the Snowdonia National Park, North Wales, UK. It is owned by Telford & Wrekin Council and has a national reputation for excellent provision of outdoor adventure activities and field studies. Although term-time use is primarily by Telford and Shropshire schools, our facilities and services are available to other client groups during weekends, halfterms and holiday times...", "Activities Include:", "Centre orienteering ,Mountain Biking, White Water Rafting, Mountain Walking , Rock Climbing, Mine Exploration, Kayaking , Open Canoeing, Wave Skiing, Orienteering, Initiative Tasks, The Ropes Course ,Adventure Activities\r\n          "]},
{"addr": ["\r\n      Crawia Road, Llanrug, Caernarfon, Gwynedd, LL55 4BS, Wales\r\n    "], "tel": ["\r\n          +44 01286 674919\r\n        "], "name": ["\r\n      Tyddyn Mawr Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": [], "desc": ["\r\n            Tyddyn Mawr is a nine hole pay as you play course set on undulating parkland which prides itself in its no frills – no fuss golf. ", "The course is the dreamchild of the late Meirion Hughes, who was keen to provide golfing opportunities for all, including providing an opportunity for young people to take up the game.\r\n          "]},
{"addr": ["\r\n      Pistyll, Pwllheli, Gwynedd, LL53 6LY, Wales\r\n    "], "tel": ["\r\n          +44 01286 660440\r\n        "], "name": ["\r\n      Gwynus Golf Course\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.golfateeswales.co.uk"], "desc": ["\r\n            Gwynus Golf Course is Snowdonia's latest golf course which overlooks the Irish Sea to the north and Cardiagan Bay to the South. The 9 hole par 3 parkland course boasts some of the most spectacular scenary to be found around any golf course in Wales. ", "Amongst its pleasant surroundings families or the unitiated can enjoy a round of golf in total tranquility. Coaching is available on request. The course also provides bags, a wide selection of clubs, putters, including childrens sets and left handed sets.\r\n          "]},
{"addr": ["\r\n      Golf Road, Abersoch, Gwynedd, LL53 7NN, Wales\r\n    "], "tel": ["\r\n          +44 01758 712622\r\n        "], "name": ["\r\n      Abersoch Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.abersochgolf.co.uk"], "desc": ["\r\n            Located on the Cambrian Coast in Snowdonia North Wales, Abersoch offers 18 holes of challenging links and parkland golf.", "Take for example the signature 246 yard par 3, 3rd hole with elevated tee and panoramic views requiring an accurate drive over both gorse and a water hazard to a sloping green with a bunker waiting at the back. Follow that with links holes hugging the coastline and contoured over a century ago through huge, natural sandunes, accuracy is key here as wayward drives are punished. ", "Abersoch is the Welsh riviera with plenty of summer sun, sea, sand and lively nightlife. Why not make a short break of it? A full day of Golf, a meal and a couple of drinks in our clubhouse then hit the village bars and clubs!\r\n          "]},
{"addr": ["\r\n      Old Church Road, Betws-y-coed, Conwy, LL24 0AL, Wales\r\n    "], "tel": ["\r\n          +44 01690 710556\r\n        "], "name": ["\r\n      Betws-y-Coed Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.betws-y-coedgolfclub.co.uk"], "desc": ["\r\n            This parkland course will certainly shatter any illusions golfers may have that 9 hole golf is merely pitch and put. Although there are only nine greens at Betws y Coed, a second set of trees ensures 18 individual challenges to all standards of golfers, males and females, young and old. Tight fairways and well guarded  greens provide a true test of skill for visiting golfers. With beautiful views of the Snowdonia mountains and the Conwy Valley providing a constant backdrop, along with meandering rivers running alongside the course, this is a real slice of golf heaven.Golf parties and visitors are always welcome here.\r\n          "]},
{"addr": ["\r\n      Pen Y Berth, Penrhos, Pwllheli, Gwynedd, LL53 7HG, Wales\r\n    "], "tel": ["\r\n          +44 01758 701200\r\n        "], "name": ["\r\n      Llyn Golf Centre\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.pen-y-berth.co.uk"], "desc": ["\r\n            At Pen-y-Berth you will find a marvelous all weather facility, suitable for beginners and experienced golfers wishing to improve their swing and all aspects of their game. ", "Llyn Golf is happy to announce that a new 9 hole pay and play Golf Course is now open. ", "For further information and a map/directions please visit our website.\r\n          "]},
{"addr": ["\r\n      Llanfaglan, Caernarfon, Gwynedd, LL54 5RP, Wales\r\n    "], "tel": ["\r\n          +44 01286 673783\r\n        "], "name": ["\r\n      Caernarfon Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.caernarfongolfclub.co.uk"], "desc": ["\r\n            Originally constructed in 1909 and extended to 18 holes in 1981, The Royal Town of Caernarfon Golf Club offers a good test to golfers of all abilities.", "With panoramic views of Wales highest mountain, Caernarfon Castle and the Isle of Anglesey this is a must play course for any golfing visitor to Wales.\r\n          "]},
{"addr": ["\r\n      Ednyfed Hill, Criccieth, Gwynedd, LL52 0PH, Wales\r\n    "], "tel": ["\r\n          +44 01766 523691\r\n        "], "name": ["\r\n      Criccieth Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.cricciethgolfclub-northwales.co.uk"], "desc": ["\r\n            This hilltop golf course is a mile inland from the seaside resort of Criccieth. It is renowned for its surroundings, with the 16th tee offering spectacular views of the Llyn Penisula, the Rhiogydd Mountain Range and Cardigan Bay. Three prime ministers have played golf in Criccieth - David Lloyd George, Andrew Bonar Law and Winstan Churchill. Open competitions are held every Bank holiday and the club 'Open Week' is held in the first week of June.\r\n          "]},
{"addr": ["\r\n      Conwy Old Road, Penmaenmawr, Penmaenmawr, Conwy, LL34 6RD, Wales\r\n    "], "tel": ["\r\n          +44 01492 623330\r\n        "], "name": ["\r\n      Penmaenmawr Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.pengolf.co.uk"], "desc": ["\r\n            Penmaenmawr golf course is as challenging in golf as it is stimulating in scenic beauty. 9 hole (18 tees), 5350 yds, par 67, SSS 66, Parkland.\r\n          "]},
{"addr": ["\r\n      Penamser Road, Porthmadog, Porthmadog, Gwynedd, LL49 9DS, Wales\r\n    "], "tel": ["\r\n          +44 01766 514225\r\n        "], "name": ["\r\n      Porthmadog Golf Driving Range\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.porthmadoggolfrange.co.uk"], "desc": ["\r\n            - 17 bay floodlit range, 10 bays inside undercover, 7 outside ", "- Range 370 yards long ", "- Stocked pro shop with 2 PGA professionals onsite ", "- Explanar Pro Training System ", "- Free lessons ", "- Free Club hire ", "- Confectionery & drinks available  ", "- Group / Individual lessons available ", "- Everyone welcome\r\n          "]},
{"addr": ["\r\n      Lon Golff, Morfa Nefyn, Pwllheli, Gwynedd, LL53 6DA, Wales\r\n    "], "tel": ["\r\n          +44 01758 720966\r\n        "], "name": ["\r\n      Nefyn and District Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.nefyn-golf-club.co.uk"], "desc": ["\r\n            Golfers are able to \"\"see the sea from every tee\"\" at Nefyn. Choose from either \"\"The Old Course - The Point\"\" comprising of the front 10 and the old 8 or \"\"The New Course\"\" comprising of the front 10 and the new 8. ", "26 holes of unadulturated golfing heaven where golfers can \"\"see the sea from every tee\"\", Anglesey from every fairway, Snowdonia from every green and on a clear day, over the Irish Sea to the Wicklow Mountains.\r\n          "]},
{"addr": ["\r\n      St Deiniol's Golf Club, Pen Y Bryn, Bangor, Gwynedd, LL57 1PX, Wales\r\n    "], "tel": ["\r\n          +44 01248 353098\r\n        "], "name": ["\r\n      St Deiniol's Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.st-deiniol.co.uk"], "desc": ["\r\n            Founded in 1906, extended and redesigned to 18 holes by James Braid in 1911. St. Deiniol, the name taken from the saint who founded the original church in the 6th century. The Clubhouse has two bars, restaurant, ladies room, lockers and showers. Men's locker room and shower. Small driving range. Two practice nets and parking facilities. Open all year - no temporary greens. Panoramic views of Snowdonia and North Wales Coast.\r\n          "]},
{"addr": ["\r\n      6 Waen Y Pandy, Tregarth, Bangor, Gwynedd, LL57 4RB, Wales\r\n    "], "tel": ["\r\n          +44 01248 600940\r\n        "], "name": ["\r\n      Snowdonia Sky Sports\r\n    "], "catid": ["Index-101321143392%252c"], "site": ["http://www.snowdoniaskysports.co.uk"], "desc": ["\r\n            Snowdonia Sky Sports was set up by local pilots in 1990 to protect the local sites and", "the interests of pilots flying in northern Snowdonia.", "Initially it was only a handful of local activists walking up on to the high mountains to", "take the huge fly downs the area offers and, at the time, there was little in the way of", "club maintenance. But as our sport has grown and sites become more crowded,", "inevitably issues have occurred and so the need for the clubs existence has became more", "and more important.", "Hang gliding and paragliding are very visual sports. We and many others love to see", "pilots free flying around the hills but, to landowners and farmers, we can sometimes be", "seen as an increasing problem and even a threat to their livelihoods. All our sites are in a", "traditional hill farming area and livestock is almost always present whenever we fly.", "Conflict between landowners and the free flying community can easily occur in these", "sensitive areas, and sites can be lost through one unfortunate incident.", "SSS now manages the flying sites on and around the Snowdon massif and, in agreement", "with the National Park, National Trust and the other private landowners, it is the", "recognised representative body for hang gliding and paragliding in the area. Our sites", "are registered with the BHPA, but site sovereignty goes nowhere without the consent of", "the landowners themselves. SSS works hard to keep communication and relationships", "open and positive with the local landowners but this relies heavily on the attitude of the", "pilots on the hill.", "Understanding the negotiated agreements for flying in this area is key to the continued", "freedom we have in these hills. SSS has produced a guide to all the major flying sites in", "this area, detailing the parking and launching agreements and any local restrictions", "arranged with the landowners - your possession of this information in everyone's", "interest.", "Your membership to SSS helps pay for the production of these sites guides and", "newsletters and goes towards helping us maintain good open relationships with the", "landowners, with the limited resources we have.", "Northern Snowdonia is an incredible place to fly and with everyone's help it can remain", "an open and friendly area to fly. Please respect the information provided in the sites", "guide and go out and enjoy some of the finest mountain flying in the UK.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Dolgellau, Gwynedd, LL40 2ES, Wales\r\n    "], "tel": ["\r\n          +44 01341 422603\r\n        "], "name": ["\r\n      Dolgellau Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.dolgellaugolfclub.com"], "desc": ["\r\n            Set amidst spectacular mountain backdrops Dolgellau Golf Club is considered to be one of the most beautiful courses in Wales. Do not be fooled by its lack of length, this 9 hole course with alternating tees for the second nine provides a true test of golf for all standards of golfer. Its small & well protected greens will reward a good straight shot and the free draining land means suberb playing conditions can be maintained even in wet weather ensuring year round play.", "The course is overlooked by Cader Idris, one of the highest mountains in Wales and the top 6 holes provide stunning views of the Mawdaach estuary and beyond.", "The club celebrates its centenary in 2010 and the splendid new clubhouse now offers an extensive food & beverage menu and is open all day every day to all golfers and the general public. With space for 150 diners the clubhouse can host a variety of different functions.\r\n          "]},
{"addr": ["\r\n      Porthmadog Golf Club, Morfa Bychan, Porthmadog, Gwynedd, LL49 9UU, Wales\r\n    "], "tel": ["\r\n          +44 01766 514124\r\n        "], "name": ["\r\n      Porthmadog Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.porthmadog-golf-club.co.uk"], "desc": ["\r\n            Situated in the seaside village of Morfa Bychan renowned for its black rock ands, the course offers a mix of heathland and linksland for the discerning golfer. The course has two distinct halves. The front nine are away from the coast with the back nine heading for the sea, and some beautiful scenary, where the course is transformed into pure links, often, claimed to be one of the most natural nine holes in Wales.\r\n          "]},
{"addr": ["\r\n      Carnguwch Organig Farm, Llithfaen, Pwllheli, Gwynedd, LL53 6NH, Wales\r\n    "], "tel": ["\r\n          +44 01758 750000\r\n        "], "name": ["\r\n      Organic Trout Fishing, Llyn Carnguwch\r\n    "], "catid": ["Index-101321143771%252c"], "site": ["http://www.organigparc.co.uk"], "desc": ["\r\n            General  Llyn Carnguwch is a 2 1/2 acre, spring water fed lake at the foot of Yr Eifl mountains on the Llyn Beninsula.  It is part of Organig Parc, a working organic farm and 5-star, eco-friendly, holiday cottage complex, and is stocked with rainbow trout.    The lake has been specifically designed so that mobility impaired anglers have access via use of purpose built platforms, and a path on the north bank of the lake. The lakeside fisherman's hut (complete with water, electricity, kettle, & scales), and toilets are also wheelchair accessible.    Charges All day, 4 fish -'£28' (Catch & release after bag caught) 4 hours, 2 fish -16 (Catch & release after bag caught)  Under 12s must be accompanied by an adult.  Under 18s - half price  Sporting tickets -2.50 per hour, minimum 2 hours    Methods  Fishing is with artificial fly and single casts only.  All conventional wet or dry flies may be used with no restriction on size (no propeller flies, boobies or rubber tailed wagglers are allowed). Barbless or de-barbed hooks only to be used for catch & release fishing. Permits available from the reception at Organig Parc.\r\n          "]},
{"addr": ["\r\n      Pwllheli Golf Club, Pwllheli, Pwllheli, Gwynedd, LL53 5PS, Wales\r\n    "], "tel": ["\r\n          +44 01758 701644\r\n        "], "name": ["\r\n      Pwllheli Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.pwllheligolfclub.co.uk"], "desc": ["\r\n            Situated close to the seashore near Pwllheli's West End, this flat course offers both gentle parkland and a true test of links golf, making it suitable for golfers of all ages and abilities. The course is characterised by tree lined fairways and picture perfect surrounding countryside. After a round of golf, players can relax in the clubhouse in one of two lounge bars, whilst enjoying the superb views of Cardigan Bay.\r\n          "]},
{"addr": ["\r\n      4 New Street, Deiniolen, Caernarfon, Gwynedd, LL55 3LH, Wales\r\n    "], "tel": ["\r\n          +44 01248 490188\r\n        "], "name": ["\r\n      Snowdonia Adventures\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.snowdonia-adventures.co.uk"], "desc": ["\r\n            Snowdonia Adventures is an established company who have been providing outdoor activities and skills courses to individuals and groups since 2000.", "We provide fun outdoor activities to individuals and groups. Our speciality is offering personally tailored skills courses for walkers,climbers and mountaineers.", "The company is owned and run by its directors Mark Handford and Shan Rees Roberts.\r\n          "]},
{"addr": ["\r\n      Llanfairfechan Golf Club, Llanerch Road, Llanfairfechan, Conwy, LL33 0EB, Wales\r\n    "], "tel": ["\r\n          +44 01248 680524\r\n        "], "name": ["\r\n      Llanfairfechan Golf Club\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": [], "desc": ["\r\n            Llanfairfechan is a parkland course founded in 1971. It's best characteristic is probably its superb year-round condition as it enjoys a mild climate for most of the year. This neat little 9-holer has its fair share of twists and turns. Although short, you'll be required to hit a variety of shots in order to score well. Bar open weekends and 1-4pm week days in summer. The town itself is a relatively small seaside town lying between Conwy and Bangor, so the views out to sea and inland are quite superb.\r\n          "]},
{"addr": ["\r\n      A5 Cerrigydrudion, Corwen, Gwynedd, LL21 9SW, Wales\r\n    "], "tel": ["\r\n          +44 01490 420530\r\n        "], "name": ["\r\n      Dragonfly Fisheries\r\n    "], "catid": ["Index-101321143771%252c"], "site": ["http://www.dragonflyfishery.com"], "desc": ["\r\n            The fishery is situated in the heart of Snowdonia National park. A 2.5 acre freshwater lake stocked with fine specimens of rainbow, brown, blue and golden trout with a minimum of 3lb in weight. The lake is stocked daily from stock pools on site. The lake itself is fed by underwater springs. ", "We are located on the A5 about 1 mile from Cerrig-y-drudion and around 10 miles between Betsw-y-Coed, Corwen and Bala.", "We offer Rod Hire and Tuition and have a wide range of flies and fishing tackle for sale.", "Fresh Trout is always available for table or BBQ.", "Our purpose built Cafe serves home made food using fresh local produce.", "Our Garden Centre offers a wide selection of plants and gardening accessories.\r\n          "]},
{"addr": ["\r\n      Southern Snowdonia, Tywyn, Gwynedd, LL36 9AJ, Wales\r\n    "], "tel": ["\r\n          +44 01654 782282\r\n        "], "name": ["\r\n      Tal-y-Llyn Lake\r\n    "], "catid": ["Index-101321143771%252c"], "site": [], "desc": ["\r\n            Tal-y-Llyn offers superb brown trout fishing and if you are looking for somewhere very different for a fishing holiday, or are just after an alternative to the somewhat sterile surroundings of many of our rainbow fisheries, Tal-y-Llyn is the answer. It has a good head of wild brown trout which is added to by a small stocking each year, but these fish quickly adapt to their new home. The glacial lake is fed by clear mountain water from the nearby heights.", "The brown trout season starts in April, and fishing from boat or bank is available. High water will be present at this time of year, but in a lake which has an average depth of only 8ft floating lines can be used from the outset. ", "September will see the main run of sea trout and salmon into the river and as these runs have improved in numbers in recent years, good sport can be anticipated. The lake will have Daddies, Sedges and Heather flies about to keep the sea angler very busy.", "If you visit at the end of the lake's fishing season - mid October - you will find that many sea trout and salmon are inhabiting the lake making flyfishing very interesting indeed. These migratory fish lie at the mouths of the streams which run into the lake on the Northern shore and can add excitement if you hook a salmon or sea trout on brown trout tackle.", "The fishing is controlled at the Tynycornel Hotel at the lake side, and not only will you be able to fish Tal-y-Llyn itself but you will also have a wide variety of flyfishing on your doorstep. The hotel has all the facilities an angler could wish for such as drying room, rod rooms and freezer plus excellent rooms and great menus.", "If you like the wilds of the moors, the hotel also manages the fishing on Llyn Bugeilyn, about ten miles away above Machynlleth, and high up at 1800ft where it offers truly wild brown trout flyfishing where small black and Peacock spiders often work well. It can be fished from a drifting boat or from sections of the bank.", "Alternatively, if you like river fishing, a beat on the Dysynni can be booked. At the right time of year sea trout and salmon run right up the river to Tal-y-Llyn. Finally, go to the estuary where you may encounter bass which, taken on a fly, are tremendous fighters. This variety of fishing is what makes the area so special.", "Tynycornel Hotel is managed by Tom Rowlands, an avid and enthusiastic angler.", "As well as all this choice of fishing, Tom is keen to promote float tubing and has tubes for hire on Tal-y-Llyn and Bugeilyn. His particular love is flyfishing for bass at the Dysinni estuary, white frog nobblers being one of the flies which work well in this area.", "Tom even uses his float tube, in calm conditions, to fish slightly further into the channel which runs offshore from this small estuary. Mullet are encountered in the Broadwater Lagoon very close to the estuary, and in the right conditions can be taken on a fly, again something small and black such as a Williams' Favourite.", "So if you feel the need for freedom in a wild setting, or fancy new flyfishing challenges, Tal-y-Llyn is an excellent bet.\r\n          "]},
{"addr": ["\r\n      Unit 1 & 2 Salem Workshops, Talysarn, Penygroes, Caernarfon, Gwynedd, LL54 6AB, Wales\r\n    "], "tel": ["\r\n          +44 01938 570680\r\n        "], "name": ["\r\n      CycleWales\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.cyclewales.net"], "desc": ["\r\n            We work in four main areas:", "- Cycle Maintenance Training up to City & Guilds Accreditation", "- Cycle workshop services including custom builds", "- Workshop Hire ", "- Cycle Coaching ", "Or of course a mix of all 4.\r\n          "]},
{"addr": ["\r\n      Caernarfon, Gwynedd, Caernarfon, Gwynedd, LL55 1YA, Wales\r\n    "], "tel": ["\r\n          +44 01286 672232\r\n        "], "name": ["\r\n      Lon Eifion Cycle Route - Caernarfon\r\n    "], "catid": ["Index-101321143401%252c"], "site": [], "desc": ["\r\n            Lon Efion stretches for 20 km (12.5 miles) between the historical town of Caernarfon and the rural village of Bryncir. From the route there are views of the Llyn Pennisula, Caernarfon Bay, Anglesey and Snowdonia.\r\n          "]},
{"addr": ["\r\n      Conwy Water Gardens And Coarse Fishery, Glyn Isa, Conwy, LL32 8TP, Wales\r\n    "], "tel": ["\r\n          +44 01492 650063\r\n        "], "name": ["\r\n      Fishing at Conwy Water Gardens & Coarse\r\n    "], "catid": ["Index-101321143771%252c"], "site": ["http://www.conwywatergardens.co.uk"], "desc": ["\r\n            Many of our regular fishermen insist that we are North Wales Premier Fishery.", "All our lakes have purpose built fishing pegs with paths leading to all fishing pegs. Disabled access is available from our car park which is only 30 meters from our specimen lake & also toilet facilities are available next to the lakes.", "A tackle shop is on site with a good selection of basic tackle & baits such as maggots, worms, pellets & ground bait. Light refreshments are available from the shop and for something more substantial from the Dutch Pancake House and Restaurant serving delicious large sweet & savoury pancakes & a choice of specials from 11am.", "The hardest choice you will have to make is which lake to fish first. The 18 peg Cannel Lake is approximately 5-6ft deep with an island down its centre ideal for pole fishing or the newcomer to the sport. It is stocked with mixed Carp, Bream, tench, Barbel & Orfe all up to 4lb in weight. ", "The Middle Specimen Lake was stocked over 15 years ago so the fish have had plenty of time to grow. It is 2 acres in size & is up to 10ft deep which makes it ideal for all year round fishing. The lake is stocked with 24lb+ carp, Ghosties, Crucians, Mirrors, Bream, Tench, Orfe, Barbel, Chub, Roach & Rudd so there is something for everyones taste.", "The Bottom Scenic Lake is situated in a small valley surrounded by trees which makes it a beautiful place to spend a summer’s day fishing. It is stocked with a mix of fish up to 6lb in weight.", "Fishing clubs are welcome & you can pre book any of the lakes.\r\n          "]},
{"addr": ["\r\n      Plasglasgwm, Penmachno, Betws-y-coed, Conwy, LL24 0PU, Wales\r\n    "], "tel": ["\r\n          +44 01690 760181\r\n        "], "name": ["\r\n      tyred out\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.tyred-out.com"], "desc": ["\r\n            Mountain biking has been the fastest growing outdoor activity for some time. Purpose-built tracks for both experienced and novice riders, in addition to an extensive network of forest trails, give unlimited biking potential.", "tyred out offers mountain bike guiding services for all levels of experience, enabling you to develop the skills needed for this irresistible sport. We offer mountain biking days that include elements of coaching and instruction and use a variety of terrain to develop your skills.", "A mountain biking day can be tailored to suit individual requirements... From mountain treks for a ride on the wild side to family-orientated breaks.\r\n          "]},
{"addr": ["\r\n      Llechwedd, Blaenau Ffestiniog, Gwynedd, LL41 3NB, Wales\r\n    "], "tel": ["\r\n          +44 01766 238007\r\n        "], "name": ["\r\n      Antur Stiniog Mountain Bike Centre\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.anturstiniog.com"], "desc": ["\r\n            Antur Stiniog is one of only a few uplift centres in Wales which means you can spend the day riding and barely pedal. The centre is predominantly a downhill and free-ride centre with blue, red, black and double black trails. ", "Trail features include flowy berms, big tabletops, rocky descents and double jumps but for a range of abilities. The uplift shuttle is direct and quick so it's possible to cover between 10 - 15 descents in one day. ", "Confident riders will get the most out of this trail centre as even the blue graded trail is fast and steep at times.    ", "Mountain Bike Trails", "Y Du (The Black): Black DH run with a super fast, flowy, jump top section with a gnarly steep rock section with big jumps to keep you on your toes, and then prepare for the steepness! Carved turns and berms all down an open hillside, finishing with another super steep rock roller and a jump section. A premier DH run.", "Black Powder: Black DH run sharing the top 50m of 'The Black' before a series of berms send you down the other side of the hill. Big rock sections and jumps await you as you traverse down the mountain side... not for the faint hearted!", "Wild Cart: Red DH / Freeride run with a super steep fun roll in through the opening berms and an endless supply of fun in the way of beautifully crafted corners, berms, jumps and step downs... from top to bottom. As much fun on a 6\"\" travel bike as a full DH rig.", "'Drafft': Red DH / Freeride run with the same features as 'Wild Cart' but with slightly less 'GNAR'. Ideal as an introduction to DH / Freeride as all the features are rollable or jumpable, dependant on your riding skills!\r\n          "]},
{"addr": ["\r\n      Treborth Driving Range, Treborth Road, Bangor, Gwynedd, LL57 2RX, Wales\r\n    "], "tel": ["\r\n          +44 01248 371170\r\n        "], "name": ["\r\n      Treborth Driving Range\r\n    "], "catid": ["Index-1013211434034209%252c"], "site": ["http://www.treborthleisure.co.uk"], "desc": ["\r\n            Lessons by P.G.A Pro. Well stocked accessory shop, 9 hole golf course, driving range. Putting green, practice bunkers, pitching areas, special group events arranged. Fully paved access and car park.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Barmouth, Gwynedd, LL41 4TA, Wales\r\n    "], "tel": ["\r\n          +44 01341 430628\r\n        "], "name": ["\r\n      South Snowdonia Greenway\r\n    "], "catid": ["Index-101321143401%252c"], "site": [], "desc": ["\r\n            The South Snowdonia Greenway is a 43 kilometre walking and cycling route which makes use of quiet roads and cycle-tracks to journey the open moorland, forests and estuary shores between Llyn Trawsfynydd and Barmouth in Southern Gwynedd.", " ", "Following Sustrans Route 82 and then the Mawddach Trail, the Greenway follows an historic route linking North Wales to Dolgellau and the coastal resort of Barmouth.", "The section south of Trawsfynydd follows the old turnpike road to Dolgellau, and the eagle-eyed will spot one or two of the old milestones along the way.", "However, this old road dips in and out of an even older Roman road, Sarn Helen, coming south from the Tomen y Mur fort near the start of the route. Beyond Dolgellau, the Greenway follows the route of the old railway line, the Mawddach Trail to the coast, finishing across the iconic Barmouth Viaduct.", "The area is rich with historical sites, from the ancient Roman fort, through 18th and 19th century railways, copper smelting works and gold mines, to the relatively modern Second World War fortifications close to the coast.", "Those seeking adventure will also not be disappointed, as the route links two of the Eryri Centres of Excellence for adventure tourism at Llyn Trawsfynydd and Coed y Brenin. With the chance to try your hand at kayaking, fishing, mountain biking, high-ropes, orienteering and geocaching at these sites, there is plenty to do.", "For a hardy few, the Greenway might also make a running challenge; from the start to crossing the railway line in Barmouth is almost exactly a marathon length. To complete the experience, Visitor Centres at both Centres of Excellence offer good quality food and drink, along with plenty of choices for refreshments in Dolgellau and Barmouth.", "Section 1: 15km section of Greenway between Llyn Trawsfynydd and Coed y Brenin", "Section 2: 12km section of Greenway between Coed y Brenin and Dolgellau", "Section 3: 15km section of Greenway between Dolgellau and Barmouth\r\n          "]},
{"addr": ["\r\n      Yr Hen Ysgol, Brynrefail, Caernarfon, Gwynedd, LL55 3NR, Wales\r\n    "], "tel": ["\r\n          +44 01286 685489\r\n        "], "name": ["\r\n      Bikefax\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.bike-fax.com"], "desc": ["\r\n            Based in the heart of prime mountain biking territory, Bikefax aims to put together the best maps and information on mountain biking available. We started things off with a guide to Snowdonia, then we thought North East Wales deserved a guidebook too. Before we knew it we were packing ourselves off to the Alps and writing a guide to Morzine & Portes du Soleil.Then we went up north, to write 'Southern Scotland & the 7stanes, and most lately off to Spain for our very latest edition to the Bikefax factory, 'Mountain Bike Southern Spain'. No rest for the wicked, eh? ", "As are so many good ideas, Bikefax was born on a rainy day in a café in North Wales. Berating the lack of quality information for mountain bikers in the UK, Sue bravely took on the task of writing a guide for her home patch of North Wales. Before long insanity had overtaken all of us and we had committed ourselves to setting up a company to provide clear dedicated trail information for the whole of the UK and abroad.\r\n          "]},
{"addr": ["\r\n      Coed Cae, Taicynhaeaf, Dolgellau, Gwynedd, LL40 2TU, Wales\r\n    "], "tel": ["\r\n          +44 01341 430628\r\n        "], "name": ["\r\n      Snow Bikers\r\n    "], "catid": ["Index-101321143401%252c"], "site": ["http://www.snowbikers.com"], "desc": ["\r\n            Guides have National Governing Body qualifications issued through the Scottish Mountain Bike Leaders Association (SMBLA) part of British Cycling, the body responsible for cycle sports in the UK. As well as being tutors for this award scheme, we have organised biking trips and development courses at all levels throughout the UK and in the French and Swiss Alps.", "Dolgellau has a strong mountain biking pedigree; as well as having its own trail network, it is close to the purpose built and demanding routes within the Coed y Brenin and Corris forests, and the more naturalistic wilderness rides around Machynlleth. As such it is the perfect venue for novice and expert mountain bikers alike. We are pleased to offer a variety of MTB training courses to provide mountain bike guiding, instruction, skills and accredited development for mountain bike riders of all abilities or why not have a go at the Cadair Idris Challenge?\r\n          "]},
{"addr": ["\r\n      75 High Street, Bangor, Gwynedd, LL57 1NR, Wales\r\n    "], "tel": ["\r\n          +44 01248 354321\r\n        "], "name": ["\r\n      Snowdonia Surf and Mountain\r\n    "], "catid": ["Index-101321143401%252c"], "site": [], "desc": ["\r\n            No description available\r\n          "]},
{"addr": ["\r\n      Beddgelert, Caernarfon, Gwynedd, LL55 4YF, Wales\r\n    "], "tel": ["\r\n          +44 01766 890233\r\n        "], "name": ["\r\n      Aberglaslyn Hall Outdoor Education\r\n    "], "catid": ["Index-101321143401%252c"], "site": [], "desc": ["\r\n            Aberglaslyn Hall is Leciestershires Outdoor Learning Centre. We can offer a full range of outdoor activities such as canoeing, kayaking, abseiling, coasteering, gorge walking as well as activities like rafting, field studies and team exercises.   The hall can accommodate up to 42 students and 6 staff.  Courses are usually residential but can also be run on a day visit basis.   All equipment is provided and the hall has three mini buses to transport all students.   Aberglaslyn is both AALS approved and has the Quality Badge from the Learning Outside the Classroom.   It is staffed by three fully qualified members of staff and can call on equally qualified members of staff should numbers dictate.     Contact Tel 01766 890233  Email aberglaslyn@beaumanor.rmplc.co.uk\r\n          "]},
{"addr": ["\r\n      Min-y-don, Arthog, Fairbourne, Gwynedd, LL39 1BZ, Wales\r\n    "], "tel": ["\r\n          +44 01341 250433\r\n        "], "name": ["\r\n      Min-y-Don Christian Adventure Centre\r\n    "], "catid": ["Index-101321143513%252c"], "site": ["http://www.minydon.com"], "desc": ["\r\n            Superbly situated on the shores of the Mawddach Estuary and set against the spectacular backdrop of the Cadair Mountain Range, MIN-Y-DON provides a unique setting for family and youth group holidays.", "ACTIVITIES AVAILABLE ON SITE:", "*Kayaking ", "*Canoeing ", "*Rock Climbing ", "*Abseiling ", "*Aerial Runway ", "*High and Low Ropes Courses ", "*Archery ", "*Orienteering ", "*Problem Solving and Team Building Games ", "*Treasure Hunts ", "*Min-Y-Don 'Safari' - (Environmental and Beach Studies) ", "*Crate Climbing ", "*Bushcraft ", "Many beautiful HILL WALKS are available throughout the adjacent countryside.\r\n          "]},
{"addr": ["\r\n      4 New Street, Deiniolen, Caernarfon, Gwynedd, LL55 3LH, Wales\r\n    "], "tel": ["\r\n          +44 01248 490188\r\n        "], "name": ["\r\n      Snowdonia Adventures\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.snowdonia-adventures.co.uk"], "desc": ["\r\n            Snowdonia Adventures is an established company who have been providing outdoor activities and skills courses to individuals and groups since 2000.", "We provide fun outdoor activities to individuals and groups. Our speciality is offering personally tailored skills courses for walkers,climbers and mountaineers.", "The company is owned and run by its directors Mark Handford and Shan Rees Roberts.\r\n          "]},
{"addr": ["\r\n      Conwy Falls Cafe, Betws-y-coed, Conwy, LL24 0PN, Wales\r\n    "], "tel": ["\r\n          +44 01690 710108\r\n        "], "name": ["\r\n      Go Below Underground Adventures\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.go-below.co.uk"], "desc": ["\r\n            Go Below is a unique adventure activity experience taking people on exciting half day underground trips. Get in on the caving action in the abandoned mines of Snowdonia for some serious underground fun!", "Challenge yourself with an abseil, zip line, boating, scrambling and climbing a waterfall as you move through this fascinating environment with info on the industrial history and artefacts to see on request. ", "Starting from our base at the Conwy Falls Cafe, you'll be kitted up with a harness, helmet, lamp, Wellington boots and safety equipment before heading off to the mine. You'll enjoy some stunning scenery on the walk up before heading into the darkness. On your underground journey through the mountain you will encounter forgotten deep blue lakes, lofty caverns and ancient mining machinery lying abandoned in the darkness. ", "You'll cross zip lines and traverses, climb rock faces, boat across water and abseil off ledges for that thrilling adrenalin rush that'll leave you feeling totally exhilarated! ", "No experience necessary, no potholing or squeezing through small gaps, and activities can be bypassed if preferred. All equipment and footwear provided. Open all year.", "Now you can also check prices, availability and book Online!\r\n          "]},
{"addr": ["\r\n      Hafan Y Mor, Pwllheli, Pwllheli, Gwynedd, LL49 9YB, Wales\r\n    "], "tel": ["\r\n          +44 01766 819187\r\n        "], "name": ["\r\n      Ropeworks\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.ropeworks.co.uk"], "desc": ["\r\n            Flying through the air on a Giant Swing, leaping for a trapeze, walking the tight rope and descending ziplines are just a few of the breathtaking challenges you can encounter here at the all new Ropeworks. Gloriously sited at our new location in Hafan y Mor Holiday Park, between Pwllheli and Criccieth. Ropeworks is North Wales’ newest, brightest and definitely most exciting attraction.\r\n          "]},
{"addr": ["\r\n      Tree Top Lodge, Llanrwst Road, Betws-y-coed, Conwy, LL24 0HA, Wales\r\n    "], "tel": ["\r\n          +44 01690 710914\r\n        "], "name": ["\r\n      Adventurers Course\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.ttadventure.co.uk"], "desc": ["\r\n            Our unique and exciting high ropes course is open to any reasonable fit person taller than 1.3m (4ft 3in). Adventurers’ are fitted with a full body harness and helmet, receive a comprehensive safety briefing then attached to a revolutionary safety system. Negotiate over 30 obstacles including balancing beams, zip wires, ropes bridges and parachute simulator without the need to detach from the safety line.", " ", "All safety equipment provided. No minimum age restriction (minimum height 1.3m, maximum weight 120kg) and suitable in wet weather.\r\n          "]},
{"addr": ["\r\n      Gilfach Ddu, Llanberis, Llanberis, Gwynedd, LL55 4TY, Wales\r\n    "], "tel": ["\r\n          +44 01286 872310\r\n        "], "name": ["\r\n      Ropes and Ladders\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.ropesandladders.co.uk"], "desc": ["\r\n            At Ropes and Ladders your instructor will lead you on a high level adventure to remember! Ideal for families groups or individuals the site is conveniently situated in the Padarn Country Park, Llanberis. A spectacular central tower gives access to circuits of tight rope walks, balance beams, swings jumps and platforms. An aerial zip line hurtles you past the tree canopy to more giant jumps swings and climbs. For a grand finale let the giant swing swoop you down and up to glimpse the mountains above the treetops.\r\n          "]},
{"addr": ["\r\n      Penrhyn Quarry, Bethesda, Gwynedd, LL57 4YG, Wales\r\n    "], "tel": ["\r\n          +44 01690 710914\r\n        "], "name": ["\r\n      Zip World\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.zipworld.co.uk"], "desc": ["\r\n            This adrenalin fuelled attraction offers visitors a totally unique experience. Speeds in excess of 100mph can be reached.", "Velocity has two pairs of zip lines.  The experience starts with the ‘Little Zipper’.  This is a great introduction and confidence builder with a maximum speed of around 45mph.  The journey takes riders into the heart of the historic quarry where the off road journey to the Big Zipper commences.", "The journey up the mountain in a specialised off road vehicle is magnificent. The Quarry Tour involves a journey through, what was once, the largest slate quarry in the world. Around every corner is evidence of an industrial past which our professional drivers bring to life and they will astound you with their knowledge and captivating stories.", "Where the Quarry Tour ends the Big Zipper begins.  This is a mile long zip line that provides riders with a birds-eye view of the historic quarry and the spectacular North Wales coastline and beyond.", "Participants will be supplied with a safety helmet, goggles and a flying suit that is wind and shower proof.\r\n          "]},
{"addr": ["\r\n      Pensarn Harbour, Llanbedr, Gwynedd, LL45 2HS, Wales\r\n    "], "tel": ["\r\n          +44 01341 241646\r\n        "], "name": ["\r\n      CMC Pensarn Harbour\r\n    "], "catid": ["Index-101321143728%252c"], "site": [], "desc": ["\r\n            Our centres at Pensarn Harbour & Bryn-y-Moel are set in fantastic locations: nestled in between the vast unspoilt beaches of the Cambrian coast and the wild beauty of the Rhinog mountain range, the centres are truly set in the heart of the Snowdonia National Park.\r\n          "]},
{"addr": ["\r\n      Y Glyn, Llanberis, Gwynedd, LL55 4EL, Wales\r\n    "], "tel": ["\r\n          +44 01286 879001\r\n        "], "name": ["\r\n      Surf-Lines Adventures\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.surf-lines.co.uk"], "desc": ["\r\n            Surf-Lines provide canoeing, kayaking, climbing, coasteering, gorge scrambling, mountain walking, orienteering and team building. Our experienced instructors provide exciting 2hr, 1/2 day, full day and multi day activities. Looking to develop your paddle skills? Why not join us on one of our popular sea kayak, canoe or white water skills courses. ", "We also have North Wales' premier canoe and kayak retail outlet packed full of the latest boats and kit. Boat demo's are availible.\r\n          "]},
{"addr": ["\r\n      Min-y-don, Arthog, Fairbourne, Gwynedd, LL39 1BZ, Wales\r\n    "], "tel": ["\r\n          +44 01341 250433\r\n        "], "name": ["\r\n      Min-y-Don Christian Adventure Centre\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.minydon.com"], "desc": ["\r\n            Superbly situated on the shores of the Mawddach Estuary and set against the spectacular backdrop of the Cadair Mountain Range, MIN-Y-DON provides a unique setting for family and youth group holidays.", "ACTIVITIES AVAILABLE ON SITE:", "*Kayaking ", "*Canoeing ", "*Rock Climbing ", "*Abseiling ", "*Aerial Runway ", "*High and Low Ropes Courses ", "*Archery ", "*Orienteering ", "*Problem Solving and Team Building Games ", "*Treasure Hunts ", "*Min-Y-Don 'Safari' - (Environmental and Beach Studies) ", "*Crate Climbing ", "*Bushcraft ", "Many beautiful HILL WALKS are available throughout the adjacent countryside.\r\n          "]},
{"addr": ["\r\n      Bryn Du Mountain Centre, Ty Du Road, Llanberis, Gwynedd, LL55 4HE, Wales\r\n    "], "tel": ["\r\n          +44 01286 870556\r\n        "], "name": ["\r\n      Boulder Adventures Ltd\r\n    "], "catid": ["Index-101321143728%252c"], "site": [], "desc": ["\r\n            Boulder Adventures is based at the Bryn Du Mountain Centre and the Padarn Water Sports Centre in Llanberis, Snowdonia. The residential centre is a spacious Victorian house in its own gardens. The Water Sports Centre is located on the shores of Llyn Padarn accessed from the Welsh Slate Museum Car Park. We offer a variety of specialist courses and multi-activity trips, as well as courses tailored to your groups specific demands, placing particular emphasis on canoeing, kayaking, climbing, abseiling, gorge scrambling and walking. Courses can last from half a day to a week although the memories will be for longer.   Our experienced and fully trained staff ensure that your stay at Boulder Adventures is as safe and enjoyable as possible, allowing you to concentrate on the activities that brought you to the centre in the first place. For further details visit: www.boulderadventures.co.uk or www.adventuresinwales.co.uk\r\n          "]},
{"addr": ["\r\n      6 New Street, Aberdovey, Gwynedd, LL35 0EH, Wales\r\n    "], "tel": ["\r\n          +44 01654 767655\r\n        "], "name": ["\r\n      Adrenalin Antics\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.adrenalinantics.com"], "desc": ["\r\n            Activity centre providing a wide range of activities including Kayaking, canoeing, mountain biking, rock climbing and more. All activities are led by fully qualified instructors.\r\n          "]},
{"addr": ["\r\n      Clegy, Llanaelhaearn, Pwllheli, Gwynedd, LL54 5AD, Wales\r\n    "], "tel": ["\r\n          +44 07751 826714\r\n        "], "name": ["\r\n      Lleyn Adventure Activities\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.llynadventures.com"], "desc": ["\r\n            We provide fun, challenging and rewarding activities around the Peninsula from our base on the outskirts of Abersoch. Activities like Coasteering, Canyoning, Climbing and Abseiling or Mountain and Coastal Walks.\r\n          "]},
{"addr": ["\r\n      Pentre Bach, Waunfawr, Caernarfon, Gwynedd, LL54 7AJ, Wales\r\n    "], "tel": ["\r\n          +44 01286 650643\r\n        "], "name": ["\r\n      Bach Ventures Ltd\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://bachventures.co.uk"], "desc": ["\r\n            Looking for a new experience or want to broaden your current knowledge? We can help provide you with that opportunity, so whether you wish to be guided around the hills, try kayaking, climbing or gorge scrambling we're happy to oblige!\r\n          "]},
{"addr": ["\r\n      Arthog, Gwynedd, Fairbourne, Gwynedd, LL39 1BX, Wales\r\n    "], "tel": ["\r\n          +44 01341 250455\r\n        "], "name": ["\r\n      Arthog Outdoor Education Centre\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.arthog.co.uk"], "desc": ["\r\n            Arthog Outdoor Education Centre is a residential outdoor education centre in the Snowdonia National Park, North Wales, UK. It is owned by Telford & Wrekin Council and has a national reputation for excellent provision of outdoor adventure activities and field studies. Although term-time use is primarily by Telford and Shropshire schools, our facilities and services are available to other client groups during weekends, halfterms and holiday times...", "Activities Include:", "Centre orienteering ,Mountain Biking, White Water Rafting, Mountain Walking , Rock Climbing, Mine Exploration, Kayaking , Open Canoeing, Wave Skiing, Orienteering, Initiative Tasks, The Ropes Course ,Adventure Activities\r\n          "]},
{"addr": ["\r\n      Gwynedd, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670964\r\n        "], "name": ["\r\n      Plas Menai\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.plasmenai.co.uk"], "desc": ["\r\n            Plas Menai is the National Watersports Centre based on the banks of the Menai Strait overlooking the Isle of Angelsey. Owned and operated by Sport Wales, the centre and facilities is set in four acres of landscaped grounds with a large waterfront and dedicated slipway. ", "The Centre is a recognised RYA and BCU training centre and offers technical courses in sailing, windsurfing, powerboating, cruising, kayaking and instructor training. During the summer holidays, Plas Menai runs a variety of youth actvity holidays for children aged between 8-17yrs. The centre also runs adventure activities for families, schools, groups and teambuilding events for corporate customers.", "The Centre can accommodate up to 100 people in comfortable twin-bedded ensuite rooms in the main complex and in our onsite dormitory style houses and is open throughout the year, (closed during the Christmas period).\r\n          "]},
{"addr": ["\r\n      Dinorwic, Caernarfon, Caernarfon, Gwynedd, LL55 3ET, Wales\r\n    "], "tel": ["\r\n          +44 01286 870853\r\n        "], "name": ["\r\n      Blue Peris Mountain Centre\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.blueperis.co.uk"], "desc": ["\r\n            An ex-employee once said 'We Do Everything!' Almost all our activities take place off-site in 'real' adventure venues. This requires a higher skill and qualification level from our instructors but greatly enhances the adventure.\r\n          "]},
{"addr": ["\r\n      Corris Uchaf, Machynlleth, Gwynedd, SY20 9RH, Wales\r\n    "], "tel": ["\r\n          +44 01654 761678\r\n        "], "name": ["\r\n      Ty'n y Berth Mountain Centre\r\n    "], "catid": ["Index-101321143728%252c"], "site": ["http://www.widehorizons.org.uk"], "desc": ["\r\n            We provide high quality Outdoor Learning courses to Schools, Colleges and Youth groups. We also provide leadership training and development courses and MLTE training and assessment courses for teachers and youth leaders.\r\n          "]},
{"addr": ["\r\n      Ynys Fechan Hall, Arthog, Dolgellau, Fairbourne, Gwynedd, LL39 1YT, Wales\r\n    "], "tel": ["\r\n          +44 01341 250369\r\n        "], "name": ["\r\n      Crisis Care - Ynys Fechan Hall\r\n    "], "catid": ["Index-101321143728%252c"], "site": [], "desc": ["\r\n            Activity Centre\r\n          "]},
{"addr": ["\r\n      Beddgelert, Caernarfon, Gwynedd, LL55 4YF, Wales\r\n    "], "tel": ["\r\n          +44 01766 890233\r\n        "], "name": ["\r\n      Aberglaslyn Hall Outdoor Education\r\n    "], "catid": ["Index-101321143728%252c"], "site": [], "desc": ["\r\n            Aberglaslyn Hall is Leciestershires Outdoor Learning Centre. We can offer a full range of outdoor activities such as canoeing, kayaking, abseiling, coasteering, gorge walking as well as activities like rafting, field studies and team exercises.   The hall can accommodate up to 42 students and 6 staff.  Courses are usually residential but can also be run on a day visit basis.   All equipment is provided and the hall has three mini buses to transport all students.   Aberglaslyn is both AALS approved and has the Quality Badge from the Learning Outside the Classroom.   It is staffed by three fully qualified members of staff and can call on equally qualified members of staff should numbers dictate.     Contact Tel 01766 890233  Email aberglaslyn@beaumanor.rmplc.co.uk\r\n          "]},
{"addr": ["\r\n      Bryn Du Mountain Centre, Ty Du Road, Llanberis, Gwynedd, LL55 4HE, Wales\r\n    "], "tel": ["\r\n          +44 01286 870556\r\n        "], "name": ["\r\n      Boulder Adventures Ltd\r\n    "], "catid": ["Index-101321143398%252c"], "site": [], "desc": ["\r\n            Boulder Adventures is based at the Bryn Du Mountain Centre and the Padarn Water Sports Centre in Llanberis, Snowdonia. The residential centre is a spacious Victorian house in its own gardens. The Water Sports Centre is located on the shores of Llyn Padarn accessed from the Welsh Slate Museum Car Park. We offer a variety of specialist courses and multi-activity trips, as well as courses tailored to your groups specific demands, placing particular emphasis on canoeing, kayaking, climbing, abseiling, gorge scrambling and walking. Courses can last from half a day to a week although the memories will be for longer.   Our experienced and fully trained staff ensure that your stay at Boulder Adventures is as safe and enjoyable as possible, allowing you to concentrate on the activities that brought you to the centre in the first place. For further details visit: www.boulderadventures.co.uk or www.adventuresinwales.co.uk\r\n          "]},
{"addr": ["\r\n      Devil's Gorge, Loggerheads Country Park, Mold, Gwynedd, CH7 5LH, Wales\r\n    "], "tel": ["\r\n          +44 0800 448 8077\r\n        "], "name": ["\r\n      Abseil UK\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.abseiluk.com"], "desc": ["\r\n            We can give you a thrill you won't forget - abseiling into the 120ft Devil's Gorge. Beginners, families, corporate entertainment and charity abseils.\r\n          "]},
{"addr": ["\r\n      Aberdyfi, Gwynedd, Aberdovey, Gwynedd, LL35 0RA, Wales\r\n    "], "tel": ["\r\n          +44 01654 767464\r\n        "], "name": ["\r\n      Outward Bound Wales Aberdovey\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.outwardbound-uk.org"], "desc": ["\r\n            Multi activity courses for individuals of one, two and three weeks in length. Course members join groups of 10-12 people under the guidance of a group instructor to have a highly memorable adventure. Specifically designed courses, which meet current educational initiatives, and curriculum objectives. They include A level PE: Vocational A levels; Raising Achievement; Key Skills, and adventure and challenge.\r\n          "]},
{"addr": ["\r\n      Bryn-y-moel, Llanbedr, Gwynedd, LL45 2HU, Wales\r\n    "], "tel": ["\r\n          +44 01341 241358\r\n        "], "name": ["\r\n      The Ranch Outdoor Discovery Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.actioncentres.co.uk"], "desc": ["\r\n            The Ranch Outdoor Discovery Centre exists to offer young people opportunities for exciting residential experiences all year round in the heart of Snowdonia - with an emphasis on personal discovery, education, safety and fun!\r\n          "]},
{"addr": ["\r\n      Llwyngwril, Gwynedd, Barmouth, Gwynedd, LL37 2QB, Wales\r\n    "], "tel": [], "name": ["\r\n      Canolfan Ty Gwyn\r\n    "], "catid": ["Index-101321143398%252c"], "site": [], "desc": ["\r\n            Ty Gwyn Outdoor Centres offers a wide range of residential and non-residential outdoor activities courses for all. We operate a range of activities and include canoeing, sailing, kayaking, climbing, abseiling, sailing, raft building, mountain walking, orienteering and mountain biking.", "In addition, we are able to offer skills based courses in mountain navigation, expeditioning, rock climbing and the Single Pitch Award, OTC mountain bike courses, sailing kayaking and canoeing.", "During the holidays we have activity days on offer to come and try out a sport, or if a group would like to book in for a day of fun, this is also possible.", "If you wish to have a group residential course, then Ty Gwyn can comfortably accommodate 30. All food can be provided and is good quality and freshly cooked.\r\n          "]},
{"addr": ["\r\n      Namaste, Morfa Crescent, Tywyn, Gwynedd, LL36 9AU, Wales\r\n    "], "tel": ["\r\n          +44 01654 711389\r\n        "], "name": ["\r\n      AC Adventures\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.outdooradventures.co.uk"], "desc": ["\r\n            AC ADVENTURES is a one man outdoor activtity provider based on the Southern edge of the Snowdonia National Park. Offering a full range of outdoor pursuits from walking, climbing to underground ( slate mine exploration) to suit all ages and abilities.With the sea 100 metres to the West and Cadair Idris to the East the whole area is ideally suited for the novice to expert alike. Holding the under 18's AALA Licence and a Fellow of the Royal Geographical Society, Ross is a well travelled mountaineer and loves to talk about his experiences as well as providing safe and challenging pursuits.  Advice and planning for overseas trips can be given.\r\n          "]},
{"addr": ["\r\n      Arthog, Gwynedd, Fairbourne, Gwynedd, LL39 1BX, Wales\r\n    "], "tel": ["\r\n          +44 01341 250455\r\n        "], "name": ["\r\n      Arthog Outdoor Education Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.arthog.co.uk"], "desc": ["\r\n            Arthog Outdoor Education Centre is a residential outdoor education centre in the Snowdonia National Park, North Wales, UK. It is owned by Telford & Wrekin Council and has a national reputation for excellent provision of outdoor adventure activities and field studies. Although term-time use is primarily by Telford and Shropshire schools, our facilities and services are available to other client groups during weekends, halfterms and holiday times...", "Activities Include:", "Centre orienteering ,Mountain Biking, White Water Rafting, Mountain Walking , Rock Climbing, Mine Exploration, Kayaking , Open Canoeing, Wave Skiing, Orienteering, Initiative Tasks, The Ropes Course ,Adventure Activities\r\n          "]},
{"addr": ["\r\n      3 - 4 Bath Place, Aberdyfi, Aberdovey, Gwynedd, LL35 0LN, Wales\r\n    "], "tel": ["\r\n          +44 01654 767024\r\n        "], "name": ["\r\n      Adventure Camps\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.adventurecamps.co.uk"], "desc": ["\r\n            Nothing beats the thrill of mountain-biking down some of the UK's most famous mountain bike trails. And virtually nothing beats canyoning down some of Wales best kept secret rivers. Very little beats a multi-activity day of climbing, walking, canoeing, surfing and raft-building. Top this off by camping on a Welsh cliff top watching the sun going down over the spectacular Cardigan Bay whilst enjoying a barbecue.", "Adventure Camps is one of the UK's leading specialist outdoor centres with some of the finest outdoor terrain on its doorstep in the magnificent Snowdonia National Park, Wales. ", "Adventure Camps; Safety, Adventure, Enjoyment, Learning, Challenge… ", "Adventure Camps provide a range of quality, value for money courses such as; ", "Adventure Weekends: ", "Get away from it all and reinvigorate yourself and your group of friends; a great way to celebrate events of all types. ", " ", "Orgainising a stag/hen weekend or day? ", "Call our office on (01654) 767024 or 07960584861 for competitive prices. We can help you with accommodation and a great programme. ", "Adventure Family: ", "Get out and discover the great outdoors, spend time with your family, learn new skills and challenge yourselves with adventurous activities. ", "Adventure Weeks: ", "Designed to promote teamwork and leadership skills. Develops a healthier lifestyle and improves fitness, ideal for youth groups, cadet groups, scouts, guides and explorers.", "Adventure Business: ", "Corporate adventure packages for fun, team development and conferencing. ", "Adventure Schools: ", "Course’s designed for you to meet your aims and objectives. The use of the outdoors makes a major contribution to physical and environmental education and enhances many other curriculum areas. It contributes to personal growth and social awareness and develops skills for life and the working world.\r\n          "]},
{"addr": ["\r\n      Pentre Bach, Waunfawr, Caernarfon, Gwynedd, LL54 7AJ, Wales\r\n    "], "tel": ["\r\n          +44 01286 650643\r\n        "], "name": ["\r\n      Bach Ventures Ltd\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://bachventures.co.uk"], "desc": ["\r\n            Looking for a new experience or want to broaden your current knowledge? We can help provide you with that opportunity, so whether you wish to be guided around the hills, try kayaking, climbing or gorge scrambling we're happy to oblige!\r\n          "]},
{"addr": ["\r\n      Dinorwic, Caernarfon, Caernarfon, Gwynedd, LL55 3ET, Wales\r\n    "], "tel": ["\r\n          +44 01286 870853\r\n        "], "name": ["\r\n      Blue Peris Mountain Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.blueperis.co.uk"], "desc": ["\r\n            An ex-employee once said 'We Do Everything!' Almost all our activities take place off-site in 'real' adventure venues. This requires a higher skill and qualification level from our instructors but greatly enhances the adventure.\r\n          "]},
{"addr": ["\r\n      Llanuwchllyn, Y Bala, Bala, Gwynedd, LL23 7ST, Wales\r\n    "], "tel": ["\r\n          +44 01678 541000\r\n        "], "name": ["\r\n      Gwersyll yr Urdd Glan-Llyn\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://Urdd.org/glanllyn"], "desc": ["\r\n            Gwersyll yr Urdd Glan-llyn is a multi activity centre situated on the shores of Llyn Tegid, near Y Bala, a mile from the village of Llanuwchllyn in the shadow of the Aran and within Eryri, Snowdonia National Park. It is an ideal location for all types of holidays and activity courses.\r\n          "]},
{"addr": ["\r\n      Glyn Padarn, Llanberis, Gwynedd, LL55 4EL, Wales\r\n    "], "tel": ["\r\n          +44 01286 870216\r\n        "], "name": ["\r\n      Kent Mountain Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.thekmc.co.uk"], "desc": ["\r\n            We aim in particular, to demonstrate how Outdoor Education can provide a special contribution through a cross-curricular approach to the delivery of the whole curriculum. We also provide an ideal base for a structured curriculum based course, particularly for field studies topics. We are registered with the Adventure Activities Licensing Authority under the Activity Centres (Young Person's Safety) Act 1995 and the Adventure Activities Licensing Regulations 1996. Our teaching staff are all fully competent in all the outdoor activities which we undertake and hold the appropriate Governing Body Awards in addition to their educational qualifications. We pride ourselves in our safety record, range of experience and degree of care afforded to our customers.", "We are situated on the shores of Lake Padarn at the foot of Snowdon and can accommodate up to forty young persons plus leaders in a single group. For every nine young persons, one group leader comes free of charge. We can also now take youngsters with mobility difficulties utilising our new accessible bedroom. Please note that the ground floor of KMC is also now wheelchair accessible.\r\n          "]},
{"addr": ["\r\n      Main Office, Beach Hut Area, Bennar Headland, Abersoch, Gwynedd, LL53 7DP, Wales\r\n    "], "tel": ["\r\n          +44 01758 712963\r\n        "], "name": ["\r\n      Abersoch Sailing School\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.abersochsailingschool.com"], "desc": ["\r\n            Watersports centre specialising in sailing, kayaking and rafting. Lessons available. Children and groups catered for. Boat hire also available including catamarans, speedboats, fun boats and canoes. March to November.\r\n          "]},
{"addr": ["\r\n      Corris Uchaf, Machynlleth, Gwynedd, SY20 9RH, Wales\r\n    "], "tel": ["\r\n          +44 01654 761678\r\n        "], "name": ["\r\n      Ty'n y Berth Mountain Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.widehorizons.org.uk"], "desc": ["\r\n            We provide high quality Outdoor Learning courses to Schools, Colleges and Youth groups. We also provide leadership training and development courses and MLTE training and assessment courses for teachers and youth leaders.\r\n          "]},
{"addr": ["\r\n      Gorwel Y Mor, Waunfawr, Caernarfon, Gwynedd, LL55 4DX, Wales\r\n    "], "tel": ["\r\n          +44 01286 650466\r\n        "], "name": ["\r\n      Mentro Mor Mynydd - Up 4 It Outdoors\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.up4itoutdoors.com"], "desc": ["\r\n            Abseiling; Coasteering; Gorge Scrambling (Also known as Gorge Walking and Canyoning. ) Hill Walking & Mountaineering; Improvised Rafting Kayaking; Off-Road Cycling (Also known as Mountain Biking.) Open Canoeing and Rock Climbing.\r\n          "]},
{"addr": ["\r\n      Min-y-don, Arthog, Fairbourne, Gwynedd, LL39 1BZ, Wales\r\n    "], "tel": ["\r\n          +44 01341 250433\r\n        "], "name": ["\r\n      Min-y-Don Christian Adventure Centre\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.minydon.com"], "desc": ["\r\n            Superbly situated on the shores of the Mawddach Estuary and set against the spectacular backdrop of the Cadair Mountain Range, MIN-Y-DON provides a unique setting for family and youth group holidays.", "ACTIVITIES AVAILABLE ON SITE:", "*Kayaking ", "*Canoeing ", "*Rock Climbing ", "*Abseiling ", "*Aerial Runway ", "*High and Low Ropes Courses ", "*Archery ", "*Orienteering ", "*Problem Solving and Team Building Games ", "*Treasure Hunts ", "*Min-Y-Don 'Safari' - (Environmental and Beach Studies) ", "*Crate Climbing ", "*Bushcraft ", "Many beautiful HILL WALKS are available throughout the adjacent countryside.\r\n          "]},
{"addr": ["\r\n      Rhyd-y-coed, The Drapers' Field Centre, Betws-y-coed, Conwy, LL24 0HB, Wales\r\n    "], "tel": ["\r\n          +44 01690 710494\r\n        "], "name": ["\r\n      FSC Rhyd-y-Creuau\r\n    "], "catid": ["Index-101321143398%252c"], "site": ["http://www.field-studies-council.org/centres/rhydycreuau.aspx"], "desc": ["\r\n            Follow in the footsteps of Darwin to discover the mountain environment of Cwm Idwal, evidence of the glaciated past, human impact today and conservation for the future. ", "The Sand Dunes at Harlech SSSI provide a variety of rich habitats on the pro-grading dune system. Coastal environments include the shingle beach, sea defences and Rocky Shores. ", "Students can discover the extensive forests surrounding the Centre. Opportunities for woodland ecology, soil profiles and orienteering ", "The River Conwy provides opportunities to study downstream changes from upland stream to estuary, freshwater ecosystems and pollution. ", "Betws-y-coed and surrounding settlements provide a range of opportunities for human geography including tourism in the National Park and settlements. ", "Adventurous activities complement fieldwork, including climbing, gorge scrambling and walking in the mountains of Snowdonia.\r\n          "]},
{"addr": ["\r\n      Beddgelert, Caernarfon, Gwynedd, LL55 4YF, Wales\r\n    "], "tel": ["\r\n          +44 01766 890233\r\n        "], "name": ["\r\n      Aberglaslyn Hall Outdoor Education\r\n    "], "catid": ["Index-101321143398%252c"], "site": [], "desc": ["\r\n            Aberglaslyn Hall is Leciestershires Outdoor Learning Centre. We can offer a full range of outdoor activities such as canoeing, kayaking, abseiling, coasteering, gorge walking as well as activities like rafting, field studies and team exercises.   The hall can accommodate up to 42 students and 6 staff.  Courses are usually residential but can also be run on a day visit basis.   All equipment is provided and the hall has three mini buses to transport all students.   Aberglaslyn is both AALS approved and has the Quality Badge from the Learning Outside the Classroom.   It is staffed by three fully qualified members of staff and can call on equally qualified members of staff should numbers dictate.     Contact Tel 01766 890233  Email aberglaslyn@beaumanor.rmplc.co.uk\r\n          "]},
{"addr": ["\r\n      Ynys Fechan Hall, Arthog, Dolgellau, Fairbourne, Gwynedd, LL39 1YT, Wales\r\n    "], "tel": ["\r\n          +44 01341 250369\r\n        "], "name": ["\r\n      Crisis Care - Ynys Fechan Hall\r\n    "], "catid": ["Index-101321143398%252c"], "site": [], "desc": ["\r\n            Activity Centre\r\n          "]},
{"addr": ["\r\n      Lon Pen Cei, Abersoch, Pwllheli, Gwynedd, LL53 7AP, Wales\r\n    "], "tel": ["\r\n          +44 01758 713067\r\n        "], "name": ["\r\n      West Coast Surf School\r\n    "], "catid": ["Index-101322143418%252c"], "site": [], "desc": ["\r\n            West Coast Surf Shop is situated in Abersoch on the Llyn Peninsula in North Wales, UK. The shop stocks a large range of watersports kit - surfboards and bodyboards, wetsuits for all shapes and seasons and wetsuit accessories. We also have a large range of surfboards from O'Shea, FireWire, Rip Curl, Maurice Cole, DHD, JP, Circle One, Bic Surfboards, Hifly, Santa Cruz & Resin 8 Surfboards\r\n          "]},
{"addr": ["\r\n      Treetops, Caemelyn, Tywyn, Gwynedd, SY23 2HA, Wales\r\n    "], "tel": ["\r\n          +44 07788 723536\r\n        "], "name": ["\r\n      Dragon Surf\r\n    "], "catid": ["Index-101322143418%252c"], "site": [], "desc": ["\r\n            Forgive the current level of detail on this page the hope is that as more of you visit we will build a page of useful and relevant data related to surfing and surfboards. For now we hope you will find useful links to surfing schools, surfboard and surfing specialists, surfboard manufacturers and some of our friends and fanatics.\r\n          "]},
{"addr": ["\r\n      Wales, Aberdovey, Gwynedd, LL35 0RF, Wales\r\n    "], "tel": ["\r\n          +44 07947 526678\r\n        "], "name": ["\r\n      Coastriders\r\n    "], "catid": ["Index-101322143418%252c"], "site": ["http://www.coastriders.co.uk"], "desc": ["\r\n            Kitesurf tuition and adventure holidays.", "Life’s all about having fun and learning as you go. Thats why as well as our regular kite courses we offer learn to kite holidays right here in Wales. Learn to kite, try kitebuggy, land kiteboarding and stand up paddleboarding while you chill out with great company over a few drinks and a BBQ.", "Learn something new.", "There’s lots of options to choose from. Have a go at the exhilarating sport of kitesurf, Kite Buggy, Landboarding or Powerkiting with Coastriders kitesurfing in West Wales. We’re open all year and run courses 7 days a week.", "It’s safer to have kitesurf lessons.", "It’s not all about strength either! During your kitesurfing lesson you will soon discover that all you need is skill and practice and before long not only will you will be up and riding, but you’ll be wanting to try out your first jumps. Be warned! kitesurfing is highly addictive.", "It’s also fun on the land.", "Landboard and KiteBuggy lessons are fun with fast progression, great on their own and can be used as a springboard onto a kitesurfing lesson and for winter practice avoiding the water. Land or traction kiting tuition is ideal for famillies and larger groups too.", "Beautiful west Wales beaches.", "Coastriders is based in Aberdovey which is just north of Aberystwyth. We generally use the beach just north of  Aberdyfi, but as we are a mobile school we use both the Aberdovey and Borth beaches, whichever gives us the mos suitable wind conditions on the day. This enables us to use coastline that has miles of never ending flat beach for landboarding and buggying as well as the safe shallow lagoons for you to learn to kitesurf in.\r\n          "]},
{"addr": ["\r\n      75 High Street, Bangor, Gwynedd, LL57 1NR, Wales\r\n    "], "tel": ["\r\n          +44 01248 354321\r\n        "], "name": ["\r\n      Snowdonia Surf and Mountain\r\n    "], "catid": ["Index-101322143418%252c"], "site": [], "desc": ["\r\n            No description available\r\n          "]},
{"addr": ["\r\n      5 Rhys Terrace, Pennal, Machynlleth, Gwynedd, SY20 9DJ, Wales\r\n    "], "tel": ["\r\n          +44 01654 791342\r\n        "], "name": ["\r\n      Kite Surf Wales\r\n    "], "catid": ["Index-101322143418%252c"], "site": ["http://www.kitesurfwales.co.uk"], "desc": ["\r\n            Kite-powered sports are easy to learn, yet can provide challenges for even the most ambitious. Based on the edge of Snowdonia National Park and surrounded by perfect kiting locations, Kite Surf Wales is THE place to fulfill your kiting desires!.\r\n          "]},
{"addr": ["\r\n      Glanafon Garage, Lon Engan, Abersoch, Gwynedd, LL53 7HP, Wales\r\n    "], "tel": ["\r\n          +44 01758 713407\r\n        "], "name": ["\r\n      Offaxis\r\n    "], "catid": ["Index-101322143421%252c"], "site": [], "desc": ["\r\n            Based by the sea in Abersoch, North Wales, OFFAXIS is a wakeboarding and surfing centre run by professional wakeboard and surf coaches. Group wakeboarding lessons and private wakeboard tuition is provided for beginners and experts alike. Similarly, you can learn to surf in a group or have a private surf lesson all to yourself or with your friends.\r\n          "]},
{"addr": ["\r\n      Bala Lake Foreshore, Bala, Gwynedd, LL23 7SR, Wales\r\n    "], "tel": ["\r\n          +44 01678 521059\r\n        "], "name": ["\r\n      Bala Adventure & Watersports\r\n    "], "catid": ["Index-101322143420"], "site": ["http://www.balawatersports.com"], "desc": ["\r\n            We have some of the most qualified and experienced coaches in Britain, with all the latest equipment to make your time with us both enjoyable and unforgettable. Great people, great location, great kit.", "Come to us to develop your skills and qualifications, or use our facilities for the sheer fun of it. Try a half day taster course in any activity, or take a fully accredited training course. You can even mix and match activities. We specialise in small groups for the best coaching experience, whether you’re an absolute beginner or an expert seeking to extend yourself to the limit.", "Windsurfing - Windsurfing on Bala Lake is continually growing in popularity - our windsurfing courses allow you to use the newest equipment in a safe environment. The centre is a HYFLY demonstration centre so you will be able to use the equipment made available by HYFLY. Our instructors will give you the right level of tuition to get you on the board and to experience this great sport confidently. For those who have had a go before, we will be able to help you improve your existing skills and develop new ones. Our staff are always keen to give advice both on and off the water and are usually available for one-to-one coaching if required. Our equipment is available for hire to the more experienced sailor.", "Kayaking/Canoeing - Beginner or expert can enjoy the ideal location of Bala Watersports for an introduction to the sport on Bala Lake or experience the challenging rapids of the local world-class white-water course. ", "Our resident coaches cover the entire spectrum of the British Canoe Association syllabus.", "Sailing - Sailing courses are run accourding to the royal yachting association guidlines. Bookings can be made over the phone or via our online booking facility.", "Branwen trips, why not explore the lake and use the steam train to get back to Bala or sail back.", "Rock Climbing/Abseiling - North Wales offers some of the best climbing in the country and you will be able to experience some of the spectacular locations. Under the close supervision of our instructors you can enjoy some great challenges and the personal achievement of getting to the top.\r\n          "]},
{"addr": ["\r\n      Gwynedd, Caernarfon, Gwynedd, LL55 1UE, Wales\r\n    "], "tel": ["\r\n          +44 01248 670964\r\n        "], "name": ["\r\n      Plas Menai\r\n    "], "catid": ["Index-101322143420"], "site": ["http://www.plasmenai.co.uk"], "desc": ["\r\n            Plas Menai is the National Watersports Centre based on the banks of the Menai Strait overlooking the Isle of Angelsey. Owned and operated by Sport Wales, the centre and facilities is set in four acres of landscaped grounds with a large waterfront and dedicated slipway. ", "The Centre is a recognised RYA and BCU training centre and offers technical courses in sailing, windsurfing, powerboating, cruising, kayaking and instructor training. During the summer holidays, Plas Menai runs a variety of youth actvity holidays for children aged between 8-17yrs. The centre also runs adventure activities for families, schools, groups and teambuilding events for corporate customers.", "The Centre can accommodate up to 100 people in comfortable twin-bedded ensuite rooms in the main complex and in our onsite dormitory style houses and is open throughout the year, (closed during the Christmas period).\r\n          "]}]